[
    {
        "name": "Afghanistan",
        "image": "afghanistan.jpg",
        "category": "Countries",
        "history": "Afghanistan has had 20 different flags since the first flag when the Hotaki dynasty which made Afghanistan independent was established in 1709.\n\nThe current flag was adopted by the Islamic Republic of Afghanistan in 2004. This flag is similar to the one flown in Afghanistan during the monarchy between 1930 and 1973. The difference is the addition of the shahadah at the top of the coat of arms (seen in yellow) in the center. This flag consists of three stripes of the colors black, red, and green. This has been present on most flags of Afghanistan in the last twenty years. The center emblem is the classical emblem of Afghanistan with a mosque with its mihrab facing Mecca. [0]",
        "meaning": "According to the website of the Embassy of Afghanistan in Washington, DC: Black represents the occupation of foreigners, the Red represents the blood of freedom fighters, and the Green represents freedom and Islam. [1]\n\nAntoher meaning could be: black appeared representing the previous (monochrome) field of Afghan flags, which in turn represented the sovereign; red was possibly introduced by emir, later king, Aman Allah as a sign of modernity and progress, copied from the Soviet flag as happened also with the 1928-1929 emblem; green stood for Islam. [2]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "black",
                "hex": "#000000"
            },{
                "name": "red",
                "hex": "#FE0000"
            },{
                "name": "green",
                "hex": "#009900"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A vertical tricolor of black, red, and green charged in the center with the national emblem [0]",
        "adoptionDate": 2004,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Afghanistan",
            "http://www.embassyofafghanistan.org/page/afghanistan-in-brief",
            "https://flagspot.net/flags/af.html#col"
        ]
    }
    ,{
        "name": "Albania",
        "image": "albania.svg",
        "category": "Countries",
        "history": "Elements of the flag's design such as the double-headed eagle were borrowed from the banner of the Byzantine Empire (specifically the emblem of the Palaiologoi dynasty). The eagle was used for heraldic purposes in the Late Middle Ages by a number of noble families in Albania (it is said that Skanderbeg used it on his flag) and became the symbol of the Albanians. The Kastrioti's coat of arms, depicting a black double-headed eagle on a red field, became famous when he led a revolt against the Ottoman Empire resulting in the independence of Albania from 1443 to 1479. This was the flag of the League of Lezhë, which was the first unified Albanian state in the Middle Ages.\n\nThe symbol of the double-headed eagle was re-used by Albanian nationalists during the 19th and early 20th centuries as a symbol of their campaign for their country's independence from the Ottoman Empire. On 28 November 1912, the Albanian Declaration of Independence was proclaimed in Vlora and the flag, raised by Ismail Qemal, was adopted as the symbol of the new nation. [0]",
        "meaning": "The red stands for bravery, strength and valor, while the double-headed eagle represents the sovereign state of Albania located in the Balkans. [0]",
        "ratio": "5:7",
        "colors": [
            {
                "name": "red",
                "hex": "#E41E20"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A silhouette of an open-winged bicephalated eagle on a red field. [0]",
        "adoptionDate": 1992,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Albania"
        ]
    }
    ,{
        "name": "Algeria",
        "image": "algeria.svg",
        "category": "Countries",
        "history": "The flag's design is derived from the standard of Emir Abdel Kadir in the 19th century which consisted of two equal vertical bands, green and white, as well as being inspired from the flag of the Algerian Regency from the 16th to the 19th century, which consisted of a white crescent and star on a red background (the same as the modern flag of Turkey; the Algerian Regency was an autonomous vassal of the Ottoman Empire). [0]",
        "meaning": "The white color represents peace; the green represents Islam; the red, the blood of those killed fighting for independence in the Algerian War (1954 to 1962) and the star and crescent represent Islam. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "green",
                "hex": "#006233"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#D21034"
            }
        ],
        "design": "A red star and crescent centered on a vertical bicolor of green and white. [0]",
        "adoptionDate": 1962,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Algeria"
        ]
    }
    ,{
        "name": "Andorra",
        "image": "andorra.svg",
        "category": "Countries",
        "history": "The national flag of the Principality of Andorra was adopted in 1866. The design is related to the flags of France, Catalonia [1] and the old County of Foix, the lands historically linked with the small country. A flag of three bars is similar to that of the French Tricolor, while the pattern of a wider middle stripe can be noted on the Catalan flag (as the royal symbol of the Crown of Aragon) and on the flag of the County of Foix (currently in France). The blue and red of the Andorran flag are also found on the French flag, with red and yellow also being the principal colors of the other two flags. From 1806 to 1866, Andorra's flag was a vertical bi-color of yellow and red. The motto in the coat of arms in the middle stripe Virtus Unita Fortior means \"Virtue United is Stronger\". [0]",
        "meaning": "The blue and red colors are similar to the French flag, while the yellow and red are related to Catalonia.",
        "ratio": "7:10",
        "colors": [
            {
                "name": "blue",
                "hex": "#0018A8"
            },{
                "name": "yellow",
                "hex": "#FEDF00"
            },{
                "name": "red",
                "hex": "#D0103A"
            }
        ],
        "design": "A vertical tricolour of blue, yellow and red with the national coat of arms centred on the middle stripe. The middle stripe is one eighth thicker than the outer bands. [0]",
        "adoptionDate": 1866,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Andorra",
            "https://flagspot.net/flags/ad.html"
        ]
    }
    ,{
        "name": "Angola",
        "image": "angola.svg",
        "category": "Countries",
        "history": "As in some other African countries, this flag is a modification of the ruling party's flag. The guerrilla movement and eventual governing party, the Popular Movement for the Liberation of Angola (MPLA), used the same design with a golden star in the center. Red stood for socialism and black for Africa. The star was modeled after the red star of the Soviet Union, which sponsored the MPLA. Later the explanation was made less party-specific. [0]",
        "meaning": "The red is for the blood spilt by Angolans during their independence struggles, while the black is for the continent of Africa. The symbol in the middle is of a crossed cog wheel (representing workers and industry) and machete (representing the peasantry, agricultural production and the armed struggle) with a gold star. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "yellow",
                "hex": "#F9D616"
            }
        ],
        "design": "It is split horizontally into an upper red half and a lower black half, and features a yellow half-gear crossed with a machete and crowned with a star. [0]",
        "adoptionDate": 1975,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Angola"
        ]
    }
    ,{
        "name": "Antigua and Barbuda",
        "image": "antigua-and-barbuda.svg",
        "category": "Countries",
        "history": "The flag dates from the achievement of self-government in 1967. It was the winning design in a competition that more than 600 local people entered. The designer and winner was Sir Reginald Samuel. [0]",
        "meaning": "The rising sun symbolises the dawning of a new era. The colours have different meanings, the black is for the African ancestry of the people, the blue for hope, the red for energy or dynamism of the people. The successive colouring of yellow, blue, and white (from the sun down) also stands for the sun, sea, and sand. The blue also represents the Caribbean Sea, and the V-shape is the symbol of victory. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "yellow",
                "hex": "#FCD116"
            },{
                "name": "blue",
                "hex": "#0072C6"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "The design of the National Flag is a red field with an inverted isosceles triangle based on the top edge of the field; the triangle contains a horizontal tricolor of black, light blue and white with a rising sun centered on top of the black band. [0]",
        "adoptionDate": 1967,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Antigua_and_Barbuda"
        ]
    }
    ,{
        "name": "Argentina",
        "image": "argentina.svg",
        "category": "Countries",
        "history": "The flag of Argentina was created by Manuel Belgrano during the Argentine War of Independence. While in Rosario he noticed that both the royalist and patriotic forces were using the same colors, Spain's yellow and red. After realizing this, Manuel Belgrano created the Cockade of Argentina, which was approved by the First Triumvirate on February 18, 1812. Encouraged by this success, he created a flag of the same colours nine days later. It used the colors that were used by the Criollos during the May Revolution in 1810.\n\nThe flag would be finally declared the national flag by the Congress of Tucumán on July 20, 1816, shortly after the declaration of independence. The proposal was made by the deputy Juan José Paso and the text written by the deputy of Charcas, José Serrano. On February 25, 1818, the Congress (now working at Buenos Aires) included the Sun of May in the War flag, after the proposal of deputy Chorroarín. The sun was copied after the one that the first Argentine coin featured in 1813. It was subsequently decided to keep it as part of the regular flag afterwards, and thus the sun no longer represents war.[0]",
        "meaning": "There are several theories about the exact design raised by Manuel Belgrano on February 27th, 1812. The same happens with the reason why he chose the colors (white and sky blue). [1] \n\nHowever, historians usually disregard this idea, and attribute them to loyalty towards the House of Bourbon. [0]\n\nAccording to the CIA World Factbook, the colors of the flag represent the clear skies and snow of the Andes, the sun symbol commemorates the appearance of the sun through cloudy skies on 25 May 1810 during the first mass demonstration in favor of independence. Besides the sun features are those of Inti, the Inca god of the sun. [2]",
        "ratio": "5:8",
        "colors": [
            {
                "name": "blue",
                "hex": "#75AADB"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "yellow",
                "hex": "#FCBF49"
            },{
                "name": "brown",
                "hex": "#843511"
            }
        ],
        "design": "A horizontal triband of light blue (top and bottom) and white with the yellow Sun of May charged in the center. [0]",
        "adoptionDate": 1812,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Argentina",
            "https://flagspot.net/flags/ar.html",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Armenia",
        "image": "armenia.svg",
        "category": "Countries",
        "history": "The Armenian Supreme Soviet adopted the current flag on 24 August 1990. On 15 June 2006, the Law on the National Flag of Armenia, governing its usage, was passed by the National Assembly of Armenia.\n\nThroughout history, there have been many variations of the Armenian flag. In ancient times, Armenian dynasties were represented by different symbolic animals displayed on their flags. \n\nAfter gaining independence, the First Republic of Armenia adopted the modern Armenian tricolor. Upon Stepan Malkhasyants's appearance in the Armenian National Council,[6] the independent Armenian government selected the colors used during the last period of Rubenid Dynasty: red, blue and yellow. An earlier prototype, which was eventually rejected, was the rainbow flag. This prototype can be seen at the Martiros Saryan House Museum in Yerevan, Armenia. They chose to replace the yellow with orange \"because it merged better with the other two colors, presenting a more pleasing composition\". [0]",
        "meaning": "According to the Constitution of the Republic of Armenia: The red emblematizes the Armenian Highland, the Armenian people's continued struggle for survival, maintenance of the Christian faith, Armenia's independence and freedom. The blue emblematizes the will of the people of Armenia to live beneath peaceful skies. The orange emblematizes the creative talent and hard-working nature of the people of Armenia. [0]\n\nHowever, the colors can be interpreted in many different ways. For example, the red symbolises the blood split by Armenians in defence of their country, orange symbolises the fertile soil of their nation and blue is for the sky. [1][2]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#D90012"
            },{
                "name": "blue",
                "hex": "#0033A0"
            },{
                "name": "orange",
                "hex": "#F2A800"
            }
        ],
        "design": "A horizontal tricolour of red, blue, and orange [0]",
        "adoptionDate": 1990,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Armenia",
            "http://www.vexilla-mundi.com/armenia_flag.html",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Australia",
        "image": "australia.svg",
        "category": "Countries",
        "history": "The flag's original design (with a six-pointed Commonwealth Star) was chosen in 1901 from entries in a competition held by the Melbourne Herald following Federation in which entries were required to include the Union Flag and Southern Cross, resulting in a British Ensign style flag, and was first flown in Melbourne on 3 September 1901, the date proclaimed as Australian National Flag Day. A slightly different design was approved by King Edward VII in 1903. The seven-pointed commonwealth star version was introduced by a proclamation dated 23 February 1908. [0]",
        "meaning": "The flag is blue with the flag of the UK in the upper hoist-side quadrant and a large seven-pointed star in the lower hoist-side quadrant known as the Commonwealth or Federation Star, representing the federation of the colonies of Australia in 1901; the star depicts one point for each of the six original states and one representing all of Australia's internal and external territories; on the fly half is a representation of the Southern Cross constellation in white with one small, five-pointed star and four larger, seven-pointed stars. [1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#00008B"
            },{
                "name": "red",
                "hex": "#FF0000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A Blue Ensign defaced with the Commonwealth Star (also known as the Federation Star) in the lower hoist quarter and the five stars of the Southern Cross in the fly half. [0]",
        "adoptionDate": 1903,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Australia",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Austria",
        "image": "austria.svg",
        "category": "Countries",
        "history": "The flag traces back to the coat of arms of the medieval Babenberg dynasty, a silver band on a red field (in heraldry: Gules a fess Argent). The origin of the Bindenschild has not been conclusively established, it possibly derived from the Styrian margraves of the Otakar noble family, who themselves may have adopted the colours from the descendants of the Carinthian duke Adalbero (ruled 1011–1035), a scion of the House of Eppenstein extinct in 1122. However, the Babenberg margrave Leopold III of Austria (1095–1136) had already been depicted with a triband shield in 1105.\n\nWhen the last Otakar Duke Ottokar IV of Styria died in 1192, the Styrian duchy was inherited by the Babenberg duke Leopold V of Austria according to the 1186 Georgenberg Pact. According to the 18th century historian Chrysostomus Hanthaler, his grandson Duke Frederick II of Austria (1230–1246), nicknamed the \"Quarrelsome\" or the \"Warlike\", the last of the Babenberg dynasty, designed a new coat of arms in red-white-red after his accession—an attempt to prevail against reluctant local nobles and to stress his autonomy towards Emperor Frederick II. The triband is first documented in a seal on a deed issued on 30 November 1230, confirming the privileges of Lilienfeld Abbey. The medieval chronicler Jans der Enikel reports that the duke appeared in a red-white-red ceremonial dress at his 1232 accolade in the Vienna Schottenstift.\n\nThe Babenberg family colors developed to the coat of arms of their Austrian possessions. After the dynasty had become extinct with Frederick's death at the 1246 Battle of the Leitha River, they were adopted by his Přemyslid successor King Ottokar II of Bohemia. Upon the 1278 Battle on the Marchfeld the colours were assumed by the victorious House of Habsburg and gradually became the coat of arms of the dynasty's Hereditary Lands within the Habsburg Monarchy. [0]",
        "meaning": "According to legend, the flag was already invented by Duke Leopold V of Austria as a consequence of his fighting during the Siege of Acre. After a fierce battle, his white surcoat was completely drenched in blood. When he removed his belt, the cloth underneath was untouched by it, revealing the combination of red-white-red. So taken was he by this singular sight that he adopted the colors and scheme as his banner. [0][1]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#ED2939"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A horizontal bicolour triband of red (top and bottom) and white. [0]",
        "adoptionDate": 1918,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Austria",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Azerbaijan",
        "image": "azerbaijan.svg",
        "category": "Countries",
        "history": "In 1828, after the last Russo-Persian War, several Khanates of the Caucasus were annexed to the Russian Empire . When the Russian Empire collapsed, Russian Azerbaijan declared its independence and joined the short-lived Transcaucasian Democratic Federative Republic, together with Georgia and Armenia. The federation was dissolved on May 26, 1918, when Georgia declared its independence as the Democratic Republic of Georgia. Both Armenia and Azerbaijan declared their independence two days later, on May 28, 1918, as the Democratic Republic of Armenia (DRA) and the Azerbaijan Democratic Republic, respectively. After gaining independence, the blue-red-green tricolour was adopted by the government of the Democratic Republic of Azerbaijan on November 9, 1918.\n\nDuring the Soviet period, Jahid Hilaloglu raised the tricolor over Baku's Maiden Tower in 1956 showing his defiance towards the system. Hilaloglu was ultimately sentenced to four years of imprisonment and his supporter Chingiz Abdullayev was institutionalized. On May 28, 1952 during the Republic Day celebrations in Germany, Mammed Amin Rasulzade raised the tricolor and asked for anyone who can be entrusted to take the flag back to Azerbaijan. Gulmirza Bagirov ultimately brought it to Azerbaijan in secret in the 1970s; this flag was hung over his house in Maştağa on January 20, 1990. During the late 1980s, unrest in Soviet Azerbaijan, the tricolor Azerbaijan Democratic Republic flag was used in demonstrations calling for independence. On November 17, 1990 on the first session of the Supreme Assembly of the Nakhichevan Autonomous Republic, the 1918 Azerbaijani flag was adopted as the national flag of the autonomous state. The first constitution since independence was adopted on November 12, 1995 after a national vote; one of the articles which described the three-color flag of the republic. [0]",
        "meaning": "The blue symbolises Azerbaijan's Turkic heritage, the red stands for progress, and the green represents Islam. [0] The crescent moon is an Islamic symbol, while the eight-pointed star represents the eight Turkic peoples of the world. [1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#00B5E2"
            },{
                "name": "red",
                "hex": "#EF3340"
            },{
                "name": "green",
                "hex": "#509E2F"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A horizontal tricolor of blue, red, and green, with a white crescent and an eight-pointed star centered on a red band [0]",
        "adoptionDate": 1918,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Azerbaijan",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Bahamas",
        "image": "bahamas.svg",
        "category": "Countries",
        "history": "The Bahamas became a crown colony of the United Kingdom within its colonial empire in 1717. Under colonial rule, the Bahama Islands used the British Blue Ensign and defaced it with the emblem of the territory. This was inspired by the ousting of the pirates, and consisted of a scene depicting a British ship chasing two pirate ships out at the high seas encircled by the motto \"Expulsis piratis restituta commercia\" (\"Pirates expelled, commerce restored\"). The emblem was designed in around 1850, but did not receive official approval until 1964.\n\nThe Bahama Islands were granted \"internal autonomy\" in 1964. After the 1972 elections, the territory started negotiations on independence. A search for a national flag began soon after, with a contest being held to determine the new design. Instead of choosing a single winning design, it was decided that the new flag was to be an amalgamation of the elements from various submissions. It was first hoisted at midnight on July 10, 1973, the day the Bahamas became an independent country. The new country also changed its name from the Bahama Islands to the Bahamas upon independence. [0]",
        "meaning": "The yellow alludes to the golden sand and the shining sun– as well as other key land-based natural resources – while the aquamarine epitomizes the sea surrounding the country (specifically the Caribbean Sea). The black symbolizes the \"strength\", \"vigor, and force\" of the Bahamian people, while the directed triangle evokes their \"enterprising and determined\" nature to cultivate the abundant natural resources on the land and in the sea. [0][1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#00ABC9"
            },{
                "name": "yellow",
                "hex": "#FAE042"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A horizontal triband of aquamarine (top and bottom) and gold with a black chevron based on the hoist side [0]",
        "adoptionDate": 1973,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Bahamas",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Bahrain",
        "image": "bahrain.svg",
        "category": "Countries",
        "history": "The earliest known flags of Bahrain were plain red. In 1820, Bahrain signed a general maritime treaty with the British Empire, and as result, a white stripe was added to the flag to signify the treaty and to distinguish it from the flags commonly used by pirates. In 1932, a serrated edge was added to the flag in order to differentiate it from those of its neighbours.\n\nThe flag originally had twenty-eight white points, but this was reduced to eight in 1972. On 14 February 2002, the number was again reduced to five, so that each of the points could stand for one of the Five Pillars of Islam. [0]",
        "meaning": "The five triangles symbolises the 5 Pillars of Islam. [0][1]",
        "ratio": "3:5",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "Red, the traditional color for flags of Persian Gulf states, with a white serrated band (five white points) on the hoist side [1]",
        "adoptionDate": 2002,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bahrain",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Bangladesh",
        "image": "bangladesh.svg",
        "category": "Countries",
        "history": "The flag is based on a similar flag used during the Bangladesh Liberation War of 1971, which had a yellow map of the country inside the red disc. In 1972 this map was deleted from the flag. One reason given was the difficulty for rendering the map correctly on both sides of the flag. [0]",
        "meaning": "The red disc represents the sun rising over Bengal, and also the blood of those who died for the independence of Bangladesh. The green field stands for the lushness of the land of Bangladesh. [0][1]",
        "ratio": "3:5",
        "colors": [
            {
                "name": "green",
                "hex": "#01796F"
            },{
                "name": "red",
                "hex": "#E11837"
            }
        ],
        "design": "A red disc on a green field. [0]",
        "adoptionDate": 1972,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bangladesh",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Barbados",
        "image": "barbados.svg",
        "category": "Countries",
        "history": "The design for the flag was created by Grantley W. Prescod and was chosen from an open competition arranged by the Barbados government. Over a thousand entries were received. [0]",
        "meaning": "The band colors represent the blue of the sea and sky and the gold of the beaches. [1]\n\nThe trident symbol was taken from Barbados' colonial badge, where the trident is shown with Britannia holding it. The broken lower part symbolises a symbolic break from its status as a colony. The three points of the trident represent the three principles of democracy – 1) government of, 2) for, and 3) by the people. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#00267F"
            },{
                "name": "yellow",
                "hex": "#FFC726"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A vertical triband of ultramarine (hoist side and fly side) and gold with a black trident-head centered on the gold band [0]",
        "adoptionDate": 1966,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Barbados",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Belarus",
        "image": "belarus.svg",
        "category": "Countries",
        "history": "The current design was introduced in 2012 by the State Committee for Standardization of the Republic of Belarus, and is adapted from a design approved in a referendum in May 1995. It is a modification of the 1951 flag used while the country was a republic of the Soviet Union. Changes made to the Soviet-era flag were the removal of symbols of communism (the hammer and sickle and the red star) and the reversal of the colors of the ornament pattern, from white on red to red on white. Since the 1995 referendum, several flags used by government officials and agencies were modeled from the national flag.\n\nThis design replaced the historical white-red-white flag used by the Belarusian People's Republic of 1918, before Belarus became a Soviet Republic, and again after it regained its independence in 1991. Opposition groups have continued to use this flag, though its display in Belarus has been restricted by the government of Belarus, which claims it was linked with Nazi collaboration during the Second World War. The white-red-white flag is used in protests against the government and by the Belarusian diaspora. [0]",
        "meaning": "The red band color recalls past struggles from oppression, the green band represents hope and the many forests of the country. [1]\n\n decorative pattern, designed in 1917 by Matrena Markevich, is displayed on the hoist of the flag (as it was previously, on the 1951 flag). The pattern, derived from local plants and flowers, is a traditional type commonly used in Belarus. These patterns are sometimes used in woven garments, most importantly in the traditional 'rushnik' – a woven towel used for ceremonial events like religious services, funerals, and other social functions. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#C8313E"
            },{
                "name": "green",
                "hex": "#4AA657"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A horizontal bicolor of red over green in a 2:1 ratio, with a red ornamental pattern on a white vertical stripe at the hoist. [0]",
        "adoptionDate": 2012,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Belarus",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Belgium",
        "image": "belgium.svg",
        "category": "Countries",
        "history": "After the death of Charlemagne, the present-day territory of Belgium (except the County of Flanders) became part of Lotharingia, which had a flag of two horizontal red stripes separated by a white stripe. The territory then passed into Spanish hands, and after the coronation of Charles V, Holy Roman Emperor yellow and red, the colours of Spain, were added. From the 16th century to the end of the 18th century, the colours of what is now Belgium were red, white and yellow. Occasionally the red cross of Burgundy was placed on the white section of the flag.\n\nDuring the period of Austrian rule, a number of different flags were tried, until the Austrian Emperor imposed the Austrian flag. The population of Brussels was opposed to this, and following the example of France, red, yellow and black cockades began to appear; those being the colours of Brabant. The colours thus correspond to the red lion of Hainaut, Limburg and Luxembourg, the yellow lion of Brabant, and the black lion of Flanders and Namur.\n\nOn August 26, 1830, the day after the rioting at the Brussels Opera and the start of the Belgian Revolution, the flag of France flew from the city hall of Brussels. The insurgents hastily replaced it with a tricolour of red, yellow and black horizontal stripes (similar to the one used during the Brabant Revolution of 1789-1790 which had established the United States of Belgium) made at a nearby fabric store. As a result, Article 193 of the Constitution of Belgium describes the colours of the Belgian nation as Red, Yellow and Black instead of using the order shown in the official flag.\n\nOn January 23, 1831, the stripes changed from horizontal to vertical and October 12 saw the flag attain its modern form, with the black placed at the hoist side of the flag. It is suggested that the change occurred to more clearly distinguish the flag of Belgium from the Dutch flag (which also has three horizontal stripes) - especially important during naval battles. [0]",
        "meaning": "The vertical design was based on the flag of France. The colors are those of the arms of the duchy of Brabant (yellow lion with red claws and tongue on a black field). [1]",
        "ratio": "13:15",
        "colors": [
            {
                "name": "black",
                "hex": "#000000"
            },{
                "name": "yellow",
                "hex": "#FFE936"
            },{
                "name": "red",
                "hex": "#FF0F21"
            }
        ],
        "design": "A vertical tricolour of black, yellow, and red. [0]",
        "adoptionDate": 1831,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Belgium",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Belize",
        "image": "belize.svg",
        "category": "Countries",
        "history": "From 1950 onward an unofficial national flag was in use. It was blue, with the coat of arms on a white disc in the centre (sometimes a blank white circle was used as the coat of arms was difficult to draw).\n\nIn 1981, Belize gained its independence and a competition was held to design a national flag for the country. The winning submission consisted of the unofficial national flag used by the People's United Party with a red border added to all four sides. This was changed to a red border on just the top and bottom before the design was officially adopted. [0]",
        "meaning": "The coat of arms features a shield flanked by two workers in front of a mahogany tree with the related motto SUB UMBRA FLOREO (I Flourish in the Shade) on a scroll at the bottom, all encircled by a green garland of 50 mahogany leaves; the colors are those of the two main political parties: blue for the PUP and red for the UDP. Various elements of the coat of arms - the figures, the tools, the mahogany tree, and the garland of leaves - recall the logging industry that led to British settlement of Belize. [1]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#003F87"
            },{
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A royal blue field with two red narrow stripes along the top and the bottom edges and a large white disk in the center bearing the National Coat of Arms of Belize [0]",
        "adoptionDate": 1981,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Belize",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Benin",
        "image": "benin.svg",
        "category": "Countries",
        "history": "Under French colonial rule over Dahomey, French authorities forbade the colony from having its own regional flag. This was because they were worried that this could increase nationalistic sentiment and lead to calls for independence. However, with the rise of the decolonization movement in Africa, the French were obliged to grant limited autonomy to Dahomey as a self-governing republic within the French Community. This was granted on December 4, 1958, and a search for a national flag began soon after.\n\nThe new flag was chosen on November 16, 1959, and remained unchanged when Dahomey became independent less than a year later on August 1, 1960. In 1972, a coup d'état took place in the country, with the new government aligning itself with Marxist–Leninist ideals. In order to symbolize the revolutionary change, the regime renamed the country to Benin and instituted a new flag three years later. This featured a green field charged with a five-pointed red star in the top-left canton.\n\nHowever, the regime's flag was never adopted by law, making it only the de facto flag of Benin.\n\nThe green flag remained in place until 1990, when economic problems and the weakening of the Soviet Union's power due to the Revolutions of 1989 culminated in the collapse of the People's Republic of Benin. The socialist regime was replaced and the original flag from 1959 was reinstated on August 1, 1990. [0]",
        "meaning": "Nationally, the yellow and green allude to the northern savannas and palm groves located in the south of the country, while the red symbolizes the blood shed by those who fought for Dahomey. [0]\n\nAccording to the Benin's national anthem: the green represents hope and revival, the red symbolizes the courage of ancestors, and the yellow represents the country's wealth. The colors are traditional Pan-African colors. [1][2]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "green",
                "hex": "#008751"
            },{
                "name": "yellow",
                "hex": "#FCD116"
            },{
                "name": "red",
                "hex": "#E8112D"
            }
        ],
        "design": "A horizontal bicolor of yellow and red with a green vertical band at the hoist. [0]",
        "adoptionDate": 1959,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Benin",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html",
            "http://www.worldflags101.com/b/benin-flag.aspx"
        ]
    }
    ,{
        "name": "Bhutan",
        "image": "bhutan.svg",
        "category": "Countries",
        "history": "The original Bhutanese flag was a bicolour square flag divided diagonally from the lower hoist to the upper fly. The field of yellow extended from the hoist to the upper fly, and the red field extended from the fly end to the lower hoist. In the centre of the flag, at the convergence of the yellow and red fields, is a green Druk, located parallel to the bottom edge and facing the fly. The design of the flag is credited to Mayeum Choying Wongmo Dorji in 1947.\n\nThe second version of the national flag was developed in 1956 for the visit of the third Druk Gyalpo Jigme Dorji Wangchuk to eastern Bhutan. During the trip the Druk Gyalpo's Secretariat began to use flags of a new design based upon a photograph of the first national flag of 1949, with the colour of the dragon changed from green to white.\n\nBeginning in the late 1950s, Dasho Shingkhar Lam, former Secretary to Jigme Dorji Wangchuck and Sixth Speaker of the National Assembly (1971–74), was requested by the king to make several modifications to the flag; he is responsible for its current design, which has remained unchanged since 1969. The king was reportedly dissatisfied that the early square Bhutanese flags did not flutter like the rectangular Indian flag displayed on the visit of an Indian official to the country. The standard measurements of the flag of Bhutan were thereafter altered to resemble the flag of India, which was 9 feet by 6 feet.\n\nIn another change, the dragon, which had formerly been placed in a roughly horizontal position in the center of the flag, was repositioned to spread out over the diagonal dividing line between the background colours. This change sought to avoid having the dragon \"face the earth\" when the flag was hanging limp. Bhutanese artist Kilkhor Lopen Jada painted a new design for the druk in which the curves of the dragon's body are relaxed to create a somewhat longer and more gently undulating shape. The king also ordered the colour of the lower half changed from red to orange. [0]",
        "meaning": "The dragon, called the Druk (Thunder Dragon), is the emblem of the nation, its white color stands for purity and the jewels in its claws symbolize wealth. The background colors represent spiritual and secular powers within Bhutan: the orange is associated with Buddhism, while the yellow denotes the ruling dynasty. [1]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "yellow",
                "hex": "#FFCC33"
            },{
                "name": "orange",
                "hex": "#FF4E12"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "Divided diagonally from the lower hoist-side corner; the upper triangle is yellow and the lower triangle is orange; centered along the dividing line is a large black and white dragon facing away from the hoist side. [0]",
        "adoptionDate": 1969,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bhutan",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Bolivia",
        "image": "bolivia.svg",
        "category": "Countries",
        "history": "The current flag of Bolivia was originally adopted in 1851.\n\nAccording to the revised Constitution of Bolivia of 2009, the Wiphala is considered a national symbol of Bolivia (along with the flag, national anthem, coat of arms, the cockade; kantuta flower and patujú flower).\n\nDespite its landlocked status, Bolivia has a naval ensign used by navy vessels on rivers and lakes. It consists of a blue field with the state flag in the canton bordered by nine small yellow five-pointed stars, with a larger yellow five-pointed star in the fly. The nine small stars represent the nine departments of Bolivia, and the larger star the nation's right to access the sea (access that it lost in 1884 in the War of the Pacific). [0]",
        "meaning": "The first description of Bolivia's national flag, together with the significance of its colors, were first established by the Supreme Decree of 1888 during the government of President Gregorio Pacheco, which specifies that:\n• Red: \"represents the blood shed by our heroes for the birth and preservation of the Republic\"\n• Yellow: \"represents our wealth and resources\"\n• Green: \"represents the richness of our natural areas as well as hope, a foundational value of our society\"",
        "ratio": "15:22",
        "colors": [
            {
                "name": "red",
                "hex": "#D52B1E"
            },{
                "name": "yellow",
                "hex": "#FCD116"
            },{
                "name": "green",
                "hex": "#007934"
            }
        ],
        "design": "A horizontal tricolor of red, yellow and green with the National Coat of Arms centered on a yellow band. [0]",
        "adoptionDate": 1851,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bolivia"
        ]
    }
    ,{
        "name": "Bosnia and Herzegovina",
        "image": "bosnia-herzegovina.svg",
        "category": "Countries",
        "history": "On 6 April 1992 Bosnia and Herzegovina gained its independence from Yugoslavia and a new flag. The flag picked was the arms of the Kings of Bosnia Kotromanić dynasty, who ruled from 1377 until 1463 over the area that is present day Bosnia-Herzegovina and Dalmatia, consisted of a blue shield with six gold fleur de lys displayed around a white bend; the fleur de lys perhaps symbolic of Lilium bosniacum, which is a native lily to the area. The flag chosen in 1992 has a white background with the Bosnian Fleur-de-lis in the center.\n\nThe Bosnian Serbs who lived in Bosnia-Herzegovina after the signing of the Dayton Agreement viewed the flag with the 6 lys as only representing the Bosniaks (formerly: Bosnian Muslims) of Bosnia-Herzegovina, even though the flag was taken from the medieval Bosnian state. The flag was eventually changed into the current flag. The new flag was introduced by the UN High Representative after the Parliament of Bosnia-Herzegovina could not decide on a solution that was acceptable to all parties. The new flag contains no historical or other references to the Bosnian state and was designed by Carlos Westendorp. [0]\n\n The original design used a blue color based on the flag of the United Nations but was then changed for a darker blue similar to the one found on the flag of Europe.",
        "meaning": "The triangle approximates the shape of the country and its three points stand for the constituent peoples - Bosniaks, Croats, and Serbs, the stars represent Europe and are meant to be continuous (thus the half stars at top and bottom), the colors (white, blue, and yellow) are often associated with neutrality and peace, and traditionally are linked with Bosnia. [1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#002395"
            },{
                "name": "yellow",
                "hex": "#FECB00"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A wide medium blue vertical band on the fly side with a yellow right triangle abutting the band and the top of the flag; the remainder of the flag is medium blue with seven full five-pointed white stars and two half stars top and bottom along the hypotenuse of the triangle. [0]",
        "adoptionDate": 1998,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bosnia_and_Herzegovina",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Botswana",
        "image": "botswana.svg",
        "category": "Countries",
        "history": "In 1885, Bechuanaland became a protectorate of the United Kingdom within its colonial empire. This occurred after the leaders of the Tswana people negotiated with the British to offer them protection from the Boers, who were invading their lands from the neighbouring South African Republic. In spite of this newfound protection, South Africa continued to pressure the British to allow them to annex Bechuanaland into their union. However, this did not occur, due to widespread opposition from the Batswana people, and Bechuanaland gained independence from Britain in 1966; the new nation was renamed Botswana.\n\nBefore it gained independence, Botswana did not have its own distinctive colonial flag, with the flag of the United Kingdom serving as the de facto flag of the protectorate. When Botswana's national flag was created in 1966, it was symbolically designed to contrast with the flag of South Africa, since the latter country was ruled under an apartheid regime. Hence, the black stripe with the white frame came to epitomize the peace and harmony between the people of African and European descent who reside in Botswana. The new flag was first hoisted at midnight on September 30, 1966, the day Botswana became an independent country. [0]",
        "meaning": "The light blue represents water—specifically, in its form of rain, as it is a precious resource in Botswana, which relies on agriculture and suffers from frequent droughts due to the dry and arid climate of the Kalahari Desert. The blue also alludes to the motto featured on the coat of arms of Botswana—Pula, which means \"Let there be rain\" in Setswana—as well as life, which is sustained by water.\n\nThe black band with the white frame has two meanings. Firstly, they symbolize the harmony and cooperation between the people of different races who live in Botswana, as well as the racial diversity of the country. Furthermore, they represent the stripes of the zebra, the national animal of Botswana. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#75AADB"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A light blue field cut horizontally in the centre by a black stripe with a thin white frame. [0]",
        "adoptionDate": 1966,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Botswana"
        ]
    }
    ,{
        "name": "Brazil",
        "image": "brazil.svg",
        "category": "Countries",
        "history": "The national flag of Brazil is often colloquially called the Auriverde (The Gold and Green). Brazil officially adopted this design for its national flag on November 19, 1889, replacing the flag of the Empire of Brazil. The concept was the work of Raimundo Teixeira Mendes, with the collaboration of Miguel Lemos, Manuel Pereira Reis and Décio Villares.\n\nUpon the proclamation of the Republic, one of the civilian leaders of the movement, the lawyer Ruy Barbosa, proposed a design for the nation's new flag strongly inspired by the flag of the United States. It was flown from November 15, 1889, until November 19, 1889, when Marshal Deodoro da Fonseca (acting as provisional president of Brazil) vetoed the design, citing concerns that it looked too similar to the flag of another state.\n\nFonseca suggested that the flag of the new republic should resemble the old imperial flag. This was intended to underscore continuity of national unity during the transition from a constitutional monarchy to a republic. Raimundo Teixeira Mendes presented a project in which the imperial coat of arms was replaced by a blue celestial globe and the positivist motto. It was presented to Fonseca, who promptly accepted. The flag was designed by a group formed by Raimundo Teixeira Mendes, Miguel Lemos, Manuel Pereira Reis and Décio Villares.\n\nThe flag has been modified on three occasions to add additional stars intended to reflect newly created states: 1960 (22 stars), 1968 (23 stars) and 1992 (27 stars). The most recent modification was made on May 12, 1992, with the addition of four stars to the celestial globe (representing states created between 1982 and 1991), and a slight change in the stars' positions was made to match the astronomical coordinates correctly. [0]",
        "meaning": "The globe has a white equatorial band with the motto ORDEM E PROGRESSO (Order and Progress). The current flag was inspired by the banner of the former Empire of Brazil (1822-1889). On the imperial flag, the green represented the House of Braganza of Pedro I, the first Emperor of Brazil, while the yellow stood for the Habsburg Family of his wife. On the modern flag the green represents the forests of the country and the yellow rhombus its mineral wealth; the blue circle and stars, which replaced the coat of arms of the original flag, depict the sky over Rio de Janeiro on the morning of 15 November 1889 - the day the Republic of Brazil was declared. The number of stars has changed with the creation of new states and has risen from an original 21 to the current 27 (one for each state and the Federal District). [1]\n\nAccording to Professor Paulo Araújo Duarte of the Federal University of Santa Catarina, \"the creators of our republican flag intended to represent the stars in the sky at Rio de Janeiro at 8:30 in the morning on 15 November 1889, the moment at which the constellation of the Southern Cross was on the meridian of Rio de Janeiro and the longer arm [of the cross] was vertical.\" Another article, citing \"O Céu da Bandeira (The Sky of the Flag)\", by J.R.V. Costa, says the exact time was actually 08:37. This last article includes the designer of the flag's explanation of his intentions regarding the stars.\n\nAccording to Brazil's national act number 5,700 of 1 September 1971, the flag portrays the stars as they would be seen by an imaginary observer an infinite distance above Rio de Janeiro standing outside the firmament in which the stars are meant to be placed (i.e. as found on a celestial globe). Thus Beta Crucis appears to the right of the constellation and Delta Crucis to the left, in mirror image of the way they actually appear in the sky (and, coincidentally, the way they appear on the Brazilian coat of arms). [0]\n\nThe motto \"Ordem e Progresso\" (\"Order and Progress\") is inspired by Auguste Comte's motto of positivism: \"L'amour pour principe et l'ordre pour base; le progrès pour but\" (\"Love as a principle and order as the basis; progress as the goal\"). [0]",
        "ratio": "7:10",
        "colors": [
            {
                "name": "green",
                "hex": "#00A859"
            },{
                "name": "yellow",
                "hex": "#FFCC29"
            },{
                "name": "blue",
                "hex": "#3E4095"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A blue disc depicting a starry sky spanned by a curved band inscribed with the national motto, within a yellow rhombus, on a green field. [0]",
        "adoptionDate": 1889,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Brazil"
        ]
    }
    ,{
        "name": "Brunei",
        "image": "brunei.svg",
        "category": "Countries",
        "history": "The flag in its present form, except for the crest, has been in use since 1906 when Brunei became a British protectorate, following the signing of an agreement between Brunei and Great Britain. Even though Brunei was only nominally independent after this, Bruneians retained certain symbols like the flag.\n\nThe crest was superimposed in 1959 after the promulgation of the Constitution of 29 September 1959.\n\nThe design was retained when the country gained full independence on 1 January 1984 as Brunei Darussalam (Brunei, Abode of Peace). [0]",
        "meaning": "The yellow field represents the sultan of Brunei.\n\nThe crest consists of a crescent (symbolising Islam) facing upwards, joined with a parasol (symbolising monarchy), with hands on the sides (signifying the benevolence of the government). On the crescent is the national motto in Arabic: \"Always render service with God's guidance\" (الدائمون المحسنون بالهدى). Below this is a banner inscribed with Brunei Darussalam (‘Brunei, the Abode of Peace’).\n\nThe black and white stripes represent Brunei's chief ministers who were once joint-regents and then – after the sultan came of age – senior advisors: the Pengiran Bendahara (First Minister, symbolised by a slightly thicker white stripe) and the Pengiran Pemancha (Second Minister, governing foreign affairs, symbolised by black). [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "yellow",
                "hex": "#F7E017"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "red",
                "hex": "#CF1126"
            }
        ],
        "design": "The crest of Brunei in the centre, on a yellow field cut by black and white diagonal stripes (parallelograms). [0]",
        "adoptionDate": 1959,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Brunei",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Bulgaria",
        "image": "bulgaria.svg",
        "category": "Countries",
        "history": "After the liberation of Bulgaria following the Russo-Turkish War of 1877–1878, the flag was described in the Tarnovo Constitution of 1879 as follows:\n\"Art. 23. The Bulgarian people's flag is three-coloured and consists of white, green and red colours, placed horizontally.\"\n\nFrom 1948 until 1990 the emblem of People's Republic of Bulgaria was placed on the left side of the white stripe. It contained a lion within a wreath of wheat ears below a red five-pointed star and above a ribbon bearing the years 681, the year of the establishment of the First Bulgarian Empire by Asparukh, and 1944, the year when the Fatherland Front took power which led to the establishment of the People's Republic of Bulgaria.\n\nThe new Constitution of Bulgaria, adopted in 1991, describes the Bulgarian flag as follows:\n\"Art. 166. The flag of the Republic of Bulgaria shall be a tricolour: white, green, and red from top, placed horizontally.\" [0]",
        "meaning": "The pan-Slavic white-blue-red colors were modified by substituting a green band (representing freedom) for the blue. [1]",
        "ratio": "3:5",
        "colors": [
            {
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "green",
                "hex": "#00966E"
            },{
                "name": "red",
                "hex": "#D62612"
            }
        ],
        "design": "A horizontal tricolour of white, green and red. [0]",
        "adoptionDate": 1881,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bulgaria"
        ]
    }
    ,{
        "name": "Burkina Faso",
        "image": "burkina-faso.svg",
        "category": "Countries",
        "history": "The flag was adopted following the coup of 1983 which brought Thomas Sankara to power. [0]",
        "meaning": "The flag is coloured in the popular Pan-African colours of the Ethiopian flag, reflecting both a break with the country’s colonial past and its unity with other African ex-colonies. The red is also said to symbolize the revolution and the green the abundance of agricultural and natural riches. The yellow star placed over the red and green stripes is the guiding light of the revolution. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#EF2B2D"
            },{
                "name": "green",
                "hex": "#009E49"
            },{
                "name": "yellow",
                "hex": "#FCD116"
            }
        ],
        "design": "A horizontal bicolor of red and green with a yellow star in the center. [0]",
        "adoptionDate": 1984,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Burkina_Faso"
        ]
    }
    ,{
        "name": "Burundi",
        "image": "burundi.svg",
        "category": "Countries",
        "history": "The national flag of Burundi was adopted on June 28, 1967 after the country's independence from Belgium on 1 July 1962.\n\nWhen the monarchy ruled over Burundi the flag featured a karyenda (a drum said to have divine power). It was believed that the drum's messages could be understood only by the rulers (mwami) who made it the laws of the state. In November 1966 the karyenda was removed from the flag following the end of the monarchy and a new flag was adopted on June 28, 1967. The karyenda was replaced with a sorghum plant which is an important agricultural product of the country. [0]",
        "meaning": "The flag is divided into four parts by a white cross. The upper and lower parts are red in color while the left and right ones are green in color. White color of the cross represents peace, green represents the nation's hopes placed on future development and red symbolizes the suffering of the nation during its freedom struggle. The three stars in triangular configuration stand for the three major ethnic groups of Burundi: the Hutu, the Twa and the Tutsi. The three stars also stand for the three elements of the national motto: Unité, Travail, Progrès (\"Unity, Work and Progress\"), which can be seen on the Coat of arms of Burundi. They also represent the loyalty that the citizens of the nations have pledged to their God, king and country. [0]",
        "ratio": "3:5",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "green",
                "hex": "#1EB53A"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A white saltire on a red and green field with a white disk, consisting of three red solid six-pointed stars outlined in green, being on the center. [0]",
        "adoptionDate": 1967,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Burundi"
        ]
    }
    ,{
        "name": "Cambodia",
        "image": "cambodia.svg",
        "category": "Countries",
        "history": "Since around 1850, the Cambodian flag has featured a depiction of Angkor Wat in the centre. The current flag, with a blue border and red central was adopted following Cambodia's independence in 1948. It was used until 9 October 1970, when a new flag was introduced for Lon Nol's Khmer Republic that lasted until the takeover of the Khmer Rouge in 1975. In 1993, the 1948 Cambodian flag was readopted.\n\nThe flag used today is the same as that established in 1948, although since then five other designs have been used. Almost all made use of the image of the temple of Angkor Wat in one form or another. This famous temple site, which dates from the 12th century, was built by the Mahidharapura monarchs. [0]",
        "meaning": "Red and blue are traditional colours of Cambodia. [0]",
        "ratio": "16:25",
        "colors": [
            {
                "name": "red",
                "hex": "#E00025"
            },{
                "name": "blue",
                "hex": "#032EA1"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "Three horizontal bands of blue, red (double width) and blue, with a depiction of Angkor Wat in white centred on the red band. [0]",
        "adoptionDate": 1948,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Cambodia"
        ]
    }
    ,{
        "name": "Cameroon",
        "image": "cameroon.svg",
        "category": "Countries",
        "history": "The original flag, made law by Law 46 of 26 October 1957, was the simple tricolor. It was confirmed on 21 February 1960 in the new constitution. [0]",
        "meaning": "The color scheme uses the traditional Pan-African colors (Cameroon was the second state to adopt them). The center stripe is thought to stand for unity: red is the colour of unity, and the star is referred to as \"the star of unity\". The yellow stands for the sun, and also the savannas in the northern part of the country, while the green is for the forests in the southern part of Cameroon. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "green",
                "hex": "#007A5E"
            },{
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "yellow",
                "hex": "#FCD116"
            }
        ],
        "design": "A vertical tricolor of green, red and yellow, with a yellow star centered on the red band. [0]",
        "adoptionDate": 1975,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Cameroon"
        ]
    }
    ,{
        "name": "Canada",
        "image": "canada.svg",
        "category": "Countries",
        "history": "The current flag is the first ever specified by law for use as the country's national flag. In 1964, Prime Minister Lester B. Pearson formed a committee to resolve the issue, sparking a serious debate about a flag change to replace the Union Flag. Out of three choices, the maple leaf design by George Stanley, based on the flag of the Royal Military College of Canada, was selected. The flag made its first official appearance on February 15, 1965; the date is now celebrated annually as National Flag of Canada Day. [0]",
        "meaning": "The maple leaf has long been a Canadian symbol. The official colors of Canada are red and white. [1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#FF0000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A vertical bicolour triband of red, white, and red in the ratio 1:2:1, with a red maple leaf charged in the centre. [0]",
        "adoptionDate": 1965,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Canada",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Cape Verde",
        "image": "cape-verde.svg",
        "category": "Countries",
        "history": "Before independence from Portugal, Cape Verde did not have an official flag, and the Portuguese national flag was used. In the late 1960s, a flag for the Portuguese overseas province of Cape Verde was proposed, consisting of the flag of Portugal defaced with the shield from the provincial arms in the lower fly. However, this flag was never adopted.\n\nThe original national flag of Cape Verde was introduced on independence in 1975, and was based on the flag of the Partido Africano para a Independência da Guiné e Cabo Verde (PAIGC). It used the common African colours of red, green and yellow, and was identical to the flag of Guinea-Bissau except for the charge in the hoist-side stripe. Their similarity evoked the plans to unite both countries, which, however, were abandoned shortly after independence. Guinea-Bissau gained independence on September 10, 1974. The national flag of Cape Verde was adopted on September 22, 1992. [0]",
        "meaning": "The 10 stars on the flag represent the main islands of the nation (a chain of islands off the coast of West Africa). The blue represents the ocean and the sky. The band of white and red represents the road toward the construction of the nation, and the colours stand for peace (white) and effort (red). [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#003893"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#CF2027"
            },{
                "name": "yellow",
                "hex": "#F7D116"
            }
        ],
        "design": "Five unequal horizontal bands; the top-most band of blue - equal to one half the width of the flag - is followed by three bands of white, red, and white, each equal to 1/12 of the width, and a bottom stripe of blue equal to one quarter of the flag width; a circle of 10, yellow, five-pointed stars is centered on the red stripe and positioned 3/8 of the length of the flag from the hoist side. [1]",
        "adoptionDate": 1992,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Cape_Verde",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Central African Republic",
        "image": "central-african-republic.svg",
        "category": "Countries",
        "history": "The flag of the Central African Republic was adopted on December 1, 1958. It was designed by Barthélemy Boganda, the first president of the autonomous territory of Oubangui-Chari, who believed that \"France and Africa must march together.\" Thus he combined the blue, white and red of the French tricolour and the Pan-African colors red, green and yellow. [0]",
        "meaning": "According to its official description, red symbolizes the blood of the people of the nation, the blood that was spilt in order to bring it independence, and the blood that they would spill to protect their nation. Blue represents the sky and freedom. White represents peace, and dignity. Green represents hope, and faith. Yellow represents tolerance.\n\nThe star guides the steps of the Central African people towards freedom and emancipation. The star is taken from that of MESAN (Movement for the Social Evolution of Black Africa), the ruling party of Central Africa from independence in August 1960 until the overthrow of General Bokassa in September 1979. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#003082"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "green",
                "hex": "#289728"
            },{
                "name": "yellow",
                "hex": "#FFCE00"
            },{
                "name": "red",
                "hex": "#D21034"
            }
        ],
        "design": "Four equal horizontal bands of blue (top), white, green, and yellow with a vertical red band in center; a yellow five-pointed star to the hoist side of the blue band. [1]",
        "adoptionDate": 1958,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Central_African_Republic",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Chad",
        "image": "chad.svg",
        "category": "Countries",
        "history": "The flag was adopted by law #59/13 for the autonomous republic and retained on independence in 1960, and in the constitution of 1962. Despite many political upheavals within Chad since independence, the flag has not been changed. This may be because the flag is not associated with any of the main power rivals within Chad, which had no sense of national identity before independence, and little after independence. [0]",
        "meaning": "Blue symbolizes, officially, the sky, hope, and water; yellow the sun and the desert to the north of the country; red progress, unity, and sacrifice. Red also recalls the blood shed for independence. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#002664"
            },{
                "name": "yellow",
                "hex": "#FECB00"
            },{
                "name": "red",
                "hex": "#C60C30"
            }
        ],
        "design": "A vertical tricolor of blue, yellow, and red. [0]",
        "adoptionDate": 1959,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Chad"
        ]
    }
    ,{
        "name": "Chile",
        "image": "chile.svg",
        "category": "Countries",
        "history": "The design of the current Chilean flag is commonly attributed to Bernardo O'Higgins's Minister of War, José Ignacio Zenteno, having been designed by the Spanish soldier Antonio Arcos, although historians argue that it was Gregorio de Andía y Varela who drew it.\n\nThe flag was made official on 18 October 1817 by a decree, of which only indirect references to the absence of a copy thereof, which was officially presented during the Pledge of Independence ceremony on 12 February 1818, a ceremony in which the bearer was Tomás Guido.\n\nThe original flag was designed according to the Golden Ratio, which is reflected in the relation between the widths of the white and blue parts of the flag, as well as several elements in blue canton. The star does not appear upright in the center of the rectangular canton, instead the upper point appears slightly inclined toward the pole in such a way that the projection of its sides divide the length of the canton golden proportion. Additionally, in the center is printed the National Coat of Arms, known from the previous Flag of the Transition and adopted in 1817.\n\nThe adoption of the star configuration goes back to the star used by the Mapuches. According to O'Higgins, the star of the flag was the Star of Arauco. In Mapuche iconography, the morning star or Venus, (Mapudungun: Wünelfe or the Hispanicized Guñelve) was represented through the figure of an octagram star or a foliated cross. Although, the star which was finally adopted bore a star having five points with the design of the guñelve remaining reflected in an asterisk inserted in the center of the star, representing the combination of European and indigenous traditions.\n\nThese designs soon fell into oblivion due to the difficulty in the flag's construction. So, the embroidered seal and the eight-pointed asterisk disappeared while the star was kept completely upright. In 1854 the proportion was determined in keeping with the colors of the flag, leaving the canton as a square and the ratio of hoist to fly set to 2:3. Finally in 1912, the diameter of the star was established, the precedence of the colors in the presidential flag and decorative cockade was determined, setting the order as blue, white and red from top to bottom or from left to right of the viewer. [0]",
        "meaning": "The star may represent a guide to progress and honor while other interpretations refer to its reference to an independent state; blue symbolizes the sky and the Pacific Ocean, white is for the snow-covered Andes, and red stands for the blood spilled to achieve independence.\n\nAccording to the epic poem La Araucana, the colors were derived from those from the flag flown by the Mapuche during the Arauco War. \"Flag Day\" is held each year on the ninth of July to commemorate the 77 soldiers who died in the 1882 Battle of La Concepción. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#0039A6"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#D52B1E"
            }
        ],
        "design": "It has a 3:2 ratio between length and width, it is divided horizontally into two bands of equal size (being the lower red). The upper area is divided once: in a square (blue), with a single centered white star; and rectangle (white), whose lengths are in proportion 1:2. [0]",
        "adoptionDate": 1817,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Chile"
        ]
    }
    ,{
        "name": "China",
        "image": "china.svg",
        "category": "Countries",
        "history": "On July 4, 1949, the sixth working group of the Preparatory Committee of the New Political Consultative Conference (新政治協商會議籌備會, PCNPCC) created a notice to submit designs for the national flag. After a few changes, the notice was published in the papers People's Daily, Beiping Liberation News, Xinmin News, Dazhong Daily, Guangming Daily, Jinbu Daily and Tianjin Daily during a period between July 15–26.\n\nZeng Liansong was working in Shanghai at the time the announcement came out; he wanted to create a flag design to express his patriotic enthusiasm for the new country. In the middle of July, he sat down in his attic for multiple nights to come up with designs. His inspiration for the current design comes from the stars shining in the night sky. He thought of a Chinese proverb \"longing for the stars, longing for the moon,\" (盼星星盼月亮, pàn xīngxīng pàn yuèliàng) which shows yearning. Later, he realized that the CPC was the great savior (大救星, dà jiùxīng) of the Chinese people, being represented by a larger star. The idea of four small stars came from On the People's Democratic Dictatorship a speech by Mao Zedong, which defined the Chinese people as consisting of four social classes. Yellow also implies that China belongs to the Chinese people, a \"yellow race\". After working out the details of the placement of the stars and their sizes (he had tried to put all of the stars in the center, but believed it would be too heavy and dull), he sent his \"Five Stars on a Field of Red\" (紅地五星旗, hóng dì wǔxīng qí) design to the committee in the middle of August.\n\nAs of August 20, a total of 3,012 designs were sent to the flag committee, which included input from committee members themselves, such as Guo Moruo and Tan Kah Kee. From August 16 to 20, the designs were viewed at the Beijing Hotel and culled down to a list of 38. These designs are collected into a book named A Reference of National Flag Designs (國旗圖案參考資料). This book was then submitted to the newly established Chinese People's Political Consultative Conference (CPPCC) for further discussion. However, Zeng's design wasn't included until Tian Han nominated it again.\n\nIn the morning of September 23, the representatives of the CPPCC discussed the national flags, but came to no conclusion. Some didn't like the symbolism which Zeng attached to the four smaller stars, and said it shouldn't include the bourgeoisie. The design Mao and others liked had a giant golden star in the corner on a red flag that was charged with a golden horizontal bar. But this design was strongly opposed by Zhang Zhizhong due to the golden bar symbolizing the tearing apart of the revolution and the country. In the night, Peng Guanghan (彭光涵) recommended Zeng's design to Zhou Enlai, Zhou was satisfied with it and asked for a larger copy of the design to be made. Tan Kah Kee also gave his advice to Mao and Zhou that the power characteristics are more important than Chinese geography characteristics, so there's no need to insist on the golden bar which stands for the Yellow River. Two days later, Mao had a meeting in his office about the flag. He persuaded everyone to adopt Zeng's design, with some slight modifications. According to earlier discussions at the Beijing Hotel, the hammer and sickle from Zeng's original design was removed since it was similar to the Flag of the Soviet Union. On September 27, 1949, Zeng's modified design was selected unanimously by the First Plenary Session of CPPCC, which changed the flag's name to \"Five-star Red Flag\". [0]",
        "meaning": "According to the current government interpretation of the flag, the red background symbolizes the revolution and the golden colours were used to \"radiate\" on the red background. The five stars and their relationship represents the unity of Chinese people under the leadership of the Communist Party of China. The orientation of the stars shows that the unity should go around a center.\n\nIn the original description of the flag by Zeng, the larger star symbolizes the Communist Party of China, and the four smaller stars that surround the big star symbolize the four social classes (the working class, the peasantry, the urban petite bourgeoisie and the national bourgeoisie) of Chinese people mentioned in Mao's \"On the People's Democratic Dictatorship\".\n\nThe five stars that formed an ellipse represent the territory of China (including Outer Mongolia) which is shaped like a Begonia leaf. It is sometimes stated that the five stars of the flag represent the five largest ethnic groups. This is generally regarded as an erroneous conflation with the \"Five Races Under One Union\" flag, used 1912–28 by the Beiyang Government of Republic of China, whose different-coloured stripes represented the Han, Manchus, Mongols, Hui, and Tibetans. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#DE2910"
            },{
                "name": "yellow",
                "hex": "#FFDE00"
            }
        ],
        "design": "A large golden star within an arc of four smaller golden stars, in the canton, on a field of red. [0]",
        "adoptionDate": 1949,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_China"
        ]
    }
    ,{
        "name": "Colombia",
        "image": "colombia.svg",
        "category": "Countries",
        "history": "Francisco de Miranda was the person who originally created the common yellow, blue and red flag of Gran Colombia that Colombia, Ecuador and Venezuela, with slight variations, share today. Miranda gave at least two sources of inspiration for his flag. In a letter written to Count Simon Romanovich Woronzoff (Vorontsov) in 1792, Miranda stated that the colors were based on a theory of primary colours given to him by the German writer and philosopher Johann Wolfgang von Goethe. Miranda described at a late-night conversation which he had with Goethe at a party in Weimar during the winter of 1785. Fascinated with Miranda's account of his exploits in the United States Revolutionary War and his travels throughout the Americas and Europe, Goethe told him that, \"Your destiny is to create in your land a place where primary colours are not distorted.\"\n\nAfter Miranda later designed his flag based on this conversation, he happily recalled seeing a fresco by Lazzaro Tavarone in the Palazzo Belimbau in Genoa that depicted Christopher Columbus unfurling a similar-coloured flag in Veragua during his fourth voyage.\n\nIn his military diary, Miranda gave another possible source of inspiration: the yellow, blue and red standard of the Burger Guard (Bürgerwache) of Hamburg, which he also saw during his travels in Germany. [0]",
        "meaning": "According to the current interpretation, yellow represents all the gold found in the Colombian land, blue represents the seas on Colombia's shores, the rivers that run through, and the sky above, and red represents the blood spilled for Colombia's independence.\n\nAlthough, the flag has other representatives such as blue for loyalty and vigilance, red for victory of battles for Colombian independence, and finally yellow for sovereignty and justice. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "yellow",
                "hex": "#FCD116"
            },{
                "name": "blue",
                "hex": "#003893"
            },{
                "name": "red",
                "hex": "#CE1126"
            }
        ],
        "design": "a horizontal tricolor of yellow (double-width), blue and red. [0]",
        "adoptionDate": 1861,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Colombia"
        ]
    }
    ,{
        "name": "Comoros",
        "image": "comoros.svg",
        "category": "Countries",
        "history": "The current flag of the Union of the Comoros was designed in 2001 and officially adopted on January 7, 2002. It continues to display the crescent and four stars, which is a motif that has been in use in slightly various forms since 1975 during the independence movement. [0]",
        "meaning": "The flag has four stripes, representing four islands of the nation: yellow is for Mohéli, white is for Mayotte (claimed by Comoros but administered by France), red is for Anjouan, and blue is for Grande Comore. The star and crescent symbol stands for Islam, which is the nation's major religion. [0]",
        "ratio": "3:5",
        "colors": [
            {
                "name": "green",
                "hex": "#3D8E33"
            },{
                "name": "yellow",
                "hex": "#FFC61E"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "blue",
                "hex": "#3A75C4"
            }
        ],
        "design": "Four horizontal stripes of yellow, white, red and blue (from top to bottom); with a green chevron based on the hoist side charged with a white crescent and four five-pointed stars. [0]",
        "adoptionDate": 2002,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Comoros"
        ]
    }
    ,{
        "name": "Democratic Republic of the Congo",
        "image": "democratic-republic-congo.svg",
        "category": "Countries",
        "history": "The previous flag was adopted in 2003. It is similar to the flag used between 1960 and 1963. The flag is based on the flag which was originally used by King Leopold's Association Internationale Africaine and was first used in 1877. The design was then implemented as the flag of the Congo Free State after the territory was recognized as an official possession of Leopold II at the Berlin Conference. After gaining independence from Belgium on 30 June 1960, the same basic design was maintained. However, six stars were incorporated to symbolise the six provinces of the country at the time. This design was used only from 1960 to 1963.\n\nThe flag of the first Republic of Mobutu Sese Seko became the official banner after Mobutu established his dictatorship. This flag was used from 1966–1971 and consisted of the same yellow star, now made smaller, situated in the top corner of the hoist side, with a red, yellow-lined band running diagonally across the center. The red symbolized the people's blood; the yellow symbolized prosperity; the blue symbolized hope; and the star represented unity. This flag was changed when the country was renamed Zaire in 1971. The Zaire flag was created as part of Mobutu's attempted re-Africanization of the nation and was used officially until Mobutu's overthrow in the First Congo War. [0]",
        "meaning": "Sky blue represents peace, red stands for the blood of the country's martyrs, yellow the country's wealth, and the star a radiant future for the country. [0]",
        "ratio": "3:4",
        "colors": [
            {
                "name": "blue",
                "hex": "#007FFF"
            },{
                "name": "yellow",
                "hex": "#F7D618"
            },{
                "name": "red",
                "hex": "#CE1021"
            }
        ],
        "design": "Sky blue flag, adorned with a yellow star in the upper left canton and cut diagonally by a red stripe with a thin yellow frame. [0]",
        "adoptionDate": 2006,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Democratic_Republic_of_the_Congo"
        ]
    }
    ,{
        "name": "Congo",
        "image": "congo.svg",
        "category": "Countries",
        "history": "Under French colonial rule over French Congo, the authorities forbade the colony from utilizing its own distinctive colonial flag. This was because they were worried that this could increase nationalistic sentiment and lead to calls for independence. However, with the rise of the decolonization movement in Africa, the French were obliged to grant limited autonomy to the Congo as a self-governing republic within the French Community. This was granted on November 28, 1958, after a referendum was held and nine months later, the Legislative Assembly began deliberating over a national flag.\n\nThe new flag was officially adopted on September 15, 1959 and remained unchanged when the French Congo became an independent state less than a year later on August 15, 1960. It was hoisted on top of the building that formerly housed the French high commission to mark the proclamation of independence. In 1968, a coup d'état took place in the country, with the new government proclaiming the People's Republic of the Congo a year later. By doing so, it became the first Marxist–Leninist country in Africa. In order to symbolize the revolutionary change, the regime instituted a new national anthem and chose a new flag. This featured a red field charged with the country's new coat of arms—a gold star with an overlapping hammer and hoe encircled by a wreath—in the top-left canton. The design was inspired by that of the Soviet Union's flag.\n\nThe red flag remained in place until 1991, when economic problems and the weakening of the Soviet Union's power due to the Revolutions of 1989 culminated in democratic elections and ultimately, the collapse of the People's Republic of the Congo. The National Conference, which oversaw the transition to a democratic government, reinstated the original flag from 1959 on June 10, 1991. The colours and shapes on the flag are mentioned in Article 5 of the constitution of the Republic of the Congo. [0]",
        "meaning": "Nationally, the green epitomizes the agriculture and forests of the Congo, while the yellow represents the \"friendship and nobility\" of the Congolese people. However, the symbolism behind the red was left unexplained. From a continental viewpoint, the green, yellow and red are the colours of the Pan-Africanist movement. It is the only Pan-Africanist flag to utilize a diagonal pattern in its design. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "green",
                "hex": "#009543"
            },{
                "name": "yellow",
                "hex": "#FBDE4A"
            },{
                "name": "red",
                "hex": "#DC241F"
            }
        ],
        "design": "A diagonal tricolour of green, yellow and red radiating from the lower hoist side corner. [0]",
        "adoptionDate": 1959,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Republic_of_the_Congo"
        ]
    }
    ,{
        "name": "Costa Rica",
        "image": "costa-rica.svg",
        "category": "Countries",
        "history": "The blue, white and red horizontal design was created in 1848 by Pacífica Fernández, wife of then president José María Castro Madriz. Fernández was inspired by France's 1848 Revolution, and the creation of the French Second Republic. The new design to the Costa Rican flag adopted the colors of the French tricolor. The coat of arms of Costa Rica was also revised in 1848 and placed in the center of the flag. In 1906, when the coat of arms was modified, the update was placed in a white disk on the flag's red stripe, and later on an oval, set toward the hoist. [0]",
        "meaning": "The blue color stands for the sky, opportunities, idealism and perseverance. The white color stands for peace, wisdom and happiness. The red color stands for the blood spilt by martyrs in defense of the country, as well as the warmth and generosity of the people. [0]",
        "ratio": "3:5",
        "colors": [
            {
                "name": "blue",
                "hex": "#002B7F"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#CE1126"
            }
        ],
        "design": "Five horizontal bands of blue, white, red (double width), white and blue. [0]",
        "adoptionDate": 1906,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Costa_Rica"
        ]
    }
    ,{
        "name": "Croatia",
        "image": "croatia.svg",
        "category": "Countries",
        "history": "The red-white-blue tricolor has been used as the Croatian flag since 1848, and the pan-Slavic colors are widely associated with romantic nationalism. While the Banovina of Croatia existed within the Kingdom of Yugoslavia, it had a similar flag without the modern crown above the chequy. During the Independent State of Croatia, flag was like the modern, but without crown and there was letter \"U\" at the top left of the flag. Also, first field of Croatian chequy was white. While Croatia was part of SFR Yugoslavia its tricolor was the same, but it had a five-pointed red star with a yellow border in place of the coat of arms. The star was replaced by the coat in May 1990, shortly after the first multiparty elections. The current flag and the coat of arms were officially adopted on 21 December 1990, about ten months before the proclamation of independence from Yugoslavia and a day before the Constitution of Croatia on 22 December 1990. [0]",
        "meaning": "The flag combines the colors of the flags of the Kingdom of Croatia (red and white), the Kingdom of Slavonia (white and blue) and the Kingdom of Dalmatia (red and blue). Those three kingdoms are the historic constituent states of the Croatian Kingdom.\n\nThe shield is in the red and white checks of Croatia. Above is a crown made of shields of its various regions. From left to right they are the ancient arms of Croatia, Dubrovnik, Dalmatia, Istria, and Slavonia. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#FF0000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "blue",
                "hex": "#171796"
            }
        ],
        "design": "A horizontal tricolor of red, white, and blue with the Coat of Arms of Croatia in the center. [0]",
        "adoptionDate": 1990,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Croatia"
        ]
    }
    ,{
        "name": "Cuba",
        "image": "cuba.svg",
        "category": "Countries",
        "history": "After fighting for the Spanish Crown against the rebel armies of Venezuela, Narciso López moved from his native Caracas to Cuba. His involvement in anticolonial movements forced him into exile. In 1849 he moved to New York City, where he continued to advocate for an independent Cuba.\n\nIt is believed that when López awoke, one morning, and looked outside the window, he saw colors of the dawn sky. He could see \"a triangle of red clouds announcing the dawn, and in the triangle shone the morning star Venus, while two white clouds departed from the triangle to divide into three blue stripes of shining heaven\". Excited by what they had just seen, López turned to his friend, Miguel Teurbe Tolón, to tell of the event that unfolded. Aside from this anecdotal version, an alternative story is that the flag was inspired by the U.S. flag (the U.S. expedition to Cuba in 1850 was intended as an annexation).\n\nThe poet Miguel Teurbe Tolón designed the flag alongside López, based upon the story of López's vision. Emilia Teurbe Tolón, Miguel's wife, sewed the first flag. López and Tolón, together with José Aniceto Iznaga Borrell, his nephew José María Sánchez Iznaga, Cirilo Villaverde and Juan Manuel Macias, settled upon the final design for the flag of Cuba: two white stripes, three blue, a red triangle, a lone star. On it they swore to fight and lay down their lives to create an independent Cuba.\n\nNarciso López used this same flag in 1850 to carry out his coup attempt, which resulted in failure. The coastal town of Cardenas was the first town that saw the splendor of the lone star flag hoisted on May 19, 1850, in the taking of the city by Cuban rebels.\n\nA year after the start of the Ten Years' War, the first Constituent Assembly of the Republic of Cuba met arms in Guáimaro, Camagüey Province. The debate focused between two flags of great symbolism, the Demajagua – which was very similar to the Chilean flag – created by Carlos Manuel de Céspedes to give start to the war of independence, and the Lone Star of Narciso López, the latter being chosen since Narciso López had taken the first step for the freedom of Cuba. [0]",
        "meaning": "The three blue stripes represent the three departments in which Cuba was divided at that time, the white purity of ideals, the light; the red triangle, originating from the French Revolution – and the three ideals of liberty, equality and fraternity: red for the blood and the courage; the star was the new state that should be added to the United States. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#CF142B"
            },{
                "name": "blue",
                "hex": "#002A8F"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "Five horizontal bands of blue alternate with white with a red chevron based on the hoist side bearing a white five-pointed star in the center. [0]",
        "adoptionDate": 1902,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Cuba"
        ]
    }
    ,{
        "name": "Cyprus",
        "image": "cyprus.svg",
        "category": "Countries",
        "history": "The current flag was created as the result of a design competition in 1960. Under the constitution, the flag should not include either blue or red colours (the colours of the flag of Greece and the flag of Turkey), nor portray a cross or a crescent. All participants deliberately avoided use of these four elements in an attempt to make the flag \"neutral\".\n\nThe winning design was based on a proposal by İsmet Güney, a Turkish Cypriot art teacher. The design was chosen by Makarios III, the first President of the Republic, with the consent of Fazil Küçük, the first Vice-President.\n\nDespite the attempt at a neutral design to promote unity amongst the constituent communities, this flag is most often used only by the Greek Cypriots, since it is associated by the Turkish Cypriots with the Greek-dominated Republic of Cyprus. Following the Turkish invasion of Cyprus and the establishment of the self-declared Turkish Republic of Northern Cyprus, Turkish-Cypriots use the Flag of Northern Cyprus. [0]",
        "meaning": "The state flag features a map of the entirety of the island, with two olive branches below (a symbol of peace) on white (another symbol of peace). The olive branches signify peace between the Turks and Greeks. The map on the flag is a copper-orange colour, symbolizing the large deposits of copper ore on the island (chiefly in the form of chalcopyrite, which is yellow in colour), from which it may have received its name.\n\nThe flag deliberately chose peaceful and neutral symbols in an attempt to indicate harmony between the rival Greek and Turkish communities, an ideal that has not yet been realized. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "yellow",
                "hex": "#D57800"
            },{
                "name": "green",
                "hex": "#4E5B31"
            }
        ],
        "design": "An outline of the country of Cyprus above twin olive branches on a white field. [0]",
        "adoptionDate": 1960,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Cyprus"
        ]
    }
    ,{
        "name": "Czech Republic",
        "image": "czech-republic.svg",
        "category": "Countries",
        "history": "Upon the dissolution of Czechoslovakia, the Czech Republic kept the Czechoslovak flag while the Slovak Republic adopted its own flag. After the establishment of an independent Czechoslovakia in 1918, the country had been using the red and white flag of Bohemia, identical to the Polish flag. Following calls for a new flag to be adopted by the fledgling state, a committee picked a design by Jaroslav Kursa, an archivist in the Czechoslovak Ministry of the Interior. His design included the red and white horizontal stripes derived from the coat of arms of Bohemia, and added a blue wedge extended halfway along the flag. The flag was banned by the Nazis in 1939, and a horizontal tricolor of white, red, and blue was enforced. The 1920 flag was restored in 1945.\n\nDuring the 1992 negotiations on the split of Czechoslovakia, a clause forbidding the use of the state symbols of Czechoslovakia by either successor state was inserted into the legislation concerning the dissolution of the federation. The Czech Republic violated this clause, passing legislation overruling the previous agreement and keeping the use of the flag. [0]",
        "meaning": "The red and white horizontal stripes derived from the coat of arms of Bohemia. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#11457E"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#D7141A"
            }
        ],
        "design": "Two equal horizontal bands of white (top) and red with a blue isosceles triangle based on the hoist side. [0]",
        "adoptionDate": 1920,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Czech_Republic"
        ]
    }
    ,{
        "name": "Denmark",
        "image": "denmark.svg",
        "category": "Countries",
        "history": "According to legend, the flag came into Danish possession during the Battle of Lyndanisse in 1219. The Danes were on a failing crusade in Estonia, but after praying to God a flag fell from the sky. After this event, Danish King Valdemar II went on to defeat the Estonians. The first recorded use of the flag appears one hundred years later. [0]",
        "meaning": "The cross design represents Christianity. [0]",
        "ratio": "28:37",
        "colors": [
            {
                "name": "red",
                "hex": "#C60C30"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A red field charged with a white cross extending to the edges; the vertical part of the cross is shifted to the hoist side. [0]",
        "adoptionDate": 1400,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Denmark"
        ]
    }
    ,{
        "name": "Djibouti",
        "image": "djibouti.svg",
        "category": "Countries",
        "history": "Before the establishment of French Somaliland, the flag of the Sultanate of Tajoura was the only ensign used in the territory. The flag of Djibouti was later created in 1972. Adopted in 1977, the national flag was an adaptation of the flag of the Ligue Populaire Africaine pour l'Independence (LPAI), a political party that led Djibouti to independence. The LPAI flag had a red triangle with a white star. For the national flag, the star was placed in an upright rather than a slanted position, and the proportions of the flag were lengthened. White, green, and light blue are the colors of the LPAI. The flag of Djibouti was raised for the first time upon independence on 27 June 1977, by the head of police Yacine Yabeh Galab. It is today flown on many governmental buildings. [0]",
        "meaning": "The light blue represents the Issa Somalis, and the green represents the Afars. The five-pointed star in its center represents the Somali-inhabited territories in Greater Somalia.\n\nEach colour symbolizes something different; namely, the earth (green), the sea and sky (light blue), peace (white), and unity (red). [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#6AB2E7"
            },{
                "name": "green",
                "hex": "#12AD2B"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#D7141A"
            }
        ],
        "design": "A horizontal bi-color of light blue and light green, with a white isosceles triangle at the hoist bearing a red star in its center. [0]",
        "adoptionDate": 1977,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Djibouti"
        ]
    }
    ,{
        "name": "Dominica",
        "image": "dominica.svg",
        "category": "Countries",
        "history": "The flag of Dominica was adopted on November 3, 1978, with some small changes having been made in 1981, 1988, and 1990. The original flag was designed by playwright Alwin Bully in early 1978 as the country prepared for independence.\n\nThe flag features the national bird emblem, the sisserou parrot, which also appears on the coat of arms granted on 21 July 1961. This parrot, endemic to Dominica, is an endangered species with a population of only 250–350 individuals. [0]",
        "meaning": "The green field represents the lush vegetation of the island. The cross represents the Trinity and Christianity, with its three colours symbolising the native Indians, the fertile soil, and the pure water. The 10 green five-pointed stars stand for the country's 10 parishes: (St. Andrew, St. David, St. George, St. John, St. Joseph, St. Luke, St. Mark, St. Patrick, St. Paul, and St. Peter), while the red disc stands for social justice. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "green",
                "hex": "#006B3F"
            },{
                "name": "yellow",
                "hex": "#FCD116"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#D41C30"
            },{
                "name": "purple",
                "hex": "#9461C9"
            }
        ],
        "design": "A green field with a central cross of three bands (the vertical part is yellow, black and white and the horizontal part is yellow, black and white) and a red disk superimposed at the center of the cross bearing a Sisserou parrot in the center encircled by ten green five-pointed stars. [0]",
        "adoptionDate": 1978,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Dominica"
        ]
    }
    ,{
        "name": "Dominican Republic",
        "image": "dominican-republic.svg",
        "category": "Countries",
        "history": "The flag was designed by Concepción Bona and Maria Trinidad Sanchez. [0]",
        "meaning": "The blue on the flag stands for liberty, the white for salvation, the red for the blood of heroes.\n\nThe national coat of arms, featuring a shield with the flag design and supported by a bay laurel branch (left) and a palm frond (right), is at the center of the cross. Above the shield, a blue ribbon displays the national motto \"Dios, Patria, Libertad\" (English: God, Fatherland, Liberty). Below the shield, the words República Dominicana appear on a red ribbon (this red ribbon is depicted in more recent versions as having its tips pointing upward). In the center of the shield, flanked by three spears (two of them holding Dominican banners) on each side, is a Bible with a small cross above it and said to be opened to the Gospel of John, chapter 8, verse 32, which reads \"Y la verdad os hará libres\" (And the truth shall make you free). [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#002D62"
            },{
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A white cross with the national coat of arms in the centre that divides the flag into four rectangles, blue and red at the top and red and blue at the bottom. [0]",
        "adoptionDate": 1863,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Dominican_Republic"
        ]
    }
]