[
    {
        "name": "Afghanistan",
        "image": "afghanistan.jpg",
        "category": "Countries",
        "history": "Afghanistan has had 20 different flags since the first flag when the Hotaki dynasty which made Afghanistan independent was established in 1709.\n\nThe current flag was adopted by the Islamic Republic of Afghanistan in 2004. This flag is similar to the one flown in Afghanistan during the monarchy between 1930 and 1973. The difference is the addition of the shahadah at the top of the coat of arms (seen in yellow) in the center. This flag consists of three stripes of the colors black, red, and green. This has been present on most flags of Afghanistan in the last twenty years. The center emblem is the classical emblem of Afghanistan with a mosque with its mihrab facing Mecca. [0]",
        "meaning": "According to the website of the Embassy of Afghanistan in Washington, DC: Black represents the occupation of foreigners, the Red represents the blood of freedom fighters, and the Green represents freedom and Islam. [1]\n\nAntoher meaning could be: black appeared representing the previous (monochrome) field of Afghan flags, which in turn represented the sovereign; red was possibly introduced by emir, later king, Aman Allah as a sign of modernity and progress, copied from the Soviet flag as happened also with the 1928-1929 emblem; green stood for Islam. [2]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "black",
                "hex": "#000000"
            },{
                "name": "red",
                "hex": "#FE0000"
            },{
                "name": "green",
                "hex": "#009900"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A vertical tricolor of black, red, and green charged in the center with the national emblem [0]",
        "adoptionDate": 2004,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Afghanistan",
            "http://www.embassyofafghanistan.org/page/afghanistan-in-brief",
            "https://flagspot.net/flags/af.html#col"
        ]
    }
    ,{
        "name": "Albania",
        "image": "albania.svg",
        "category": "Countries",
        "history": "Elements of the flag's design such as the double-headed eagle were borrowed from the banner of the Byzantine Empire (specifically the emblem of the Palaiologoi dynasty). The eagle was used for heraldic purposes in the Late Middle Ages by a number of noble families in Albania (it is said that Skanderbeg used it on his flag) and became the symbol of the Albanians. The Kastrioti's coat of arms, depicting a black double-headed eagle on a red field, became famous when he led a revolt against the Ottoman Empire resulting in the independence of Albania from 1443 to 1479. This was the flag of the League of Lezhë, which was the first unified Albanian state in the Middle Ages.\n\nThe symbol of the double-headed eagle was re-used by Albanian nationalists during the 19th and early 20th centuries as a symbol of their campaign for their country's independence from the Ottoman Empire. On 28 November 1912, the Albanian Declaration of Independence was proclaimed in Vlora and the flag, raised by Ismail Qemal, was adopted as the symbol of the new nation. [0]",
        "meaning": "The red stands for bravery, strength and valor, while the double-headed eagle represents the sovereign state of Albania located in the Balkans. [0]",
        "ratio": "5:7",
        "colors": [
            {
                "name": "red",
                "hex": "#E41E20"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A silhouette of an open-winged bicephalated eagle on a red field. [0]",
        "adoptionDate": 1992,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Albania"
        ]
    }
    ,{
        "name": "Algeria",
        "image": "algeria.svg",
        "category": "Countries",
        "history": "The flag's design is derived from the standard of Emir Abdel Kadir in the 19th century which consisted of two equal vertical bands, green and white, as well as being inspired from the flag of the Algerian Regency from the 16th to the 19th century, which consisted of a white crescent and star on a red background (the same as the modern flag of Turkey; the Algerian Regency was an autonomous vassal of the Ottoman Empire). [0]",
        "meaning": "The white color represents peace; the green represents Islam; the red, the blood of those killed fighting for independence in the Algerian War (1954 to 1962) and the star and crescent represent Islam. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "green",
                "hex": "#006233"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#D21034"
            }
        ],
        "design": "A red star and crescent centered on a vertical bicolor of green and white. [0]",
        "adoptionDate": 1962,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Algeria"
        ]
    }
    ,{
        "name": "Andorra",
        "image": "andorra.svg",
        "category": "Countries",
        "history": "The national flag of the Principality of Andorra was adopted in 1866. The design is related to the flags of France, Catalonia [1] and the old County of Foix, the lands historically linked with the small country. A flag of three bars is similar to that of the French Tricolor, while the pattern of a wider middle stripe can be noted on the Catalan flag (as the royal symbol of the Crown of Aragon) and on the flag of the County of Foix (currently in France). The blue and red of the Andorran flag are also found on the French flag, with red and yellow also being the principal colors of the other two flags. From 1806 to 1866, Andorra's flag was a vertical bi-color of yellow and red. The motto in the coat of arms in the middle stripe Virtus Unita Fortior means \"Virtue United is Stronger\". [0]",
        "meaning": "The blue and red colors are similar to the French flag, while the yellow and red are related to Catalonia.",
        "ratio": "7:10",
        "colors": [
            {
                "name": "blue",
                "hex": "#0018A8"
            },{
                "name": "yellow",
                "hex": "#FEDF00"
            },{
                "name": "red",
                "hex": "#D0103A"
            }
        ],
        "design": "A vertical tricolour of blue, yellow and red with the national coat of arms centred on the middle stripe. The middle stripe is one eighth thicker than the outer bands. [0]",
        "adoptionDate": 1866,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Andorra",
            "https://flagspot.net/flags/ad.html"
        ]
    }
    ,{
        "name": "Angola",
        "image": "angola.svg",
        "category": "Countries",
        "history": "As in some other African countries, this flag is a modification of the ruling party's flag. The guerrilla movement and eventual governing party, the Popular Movement for the Liberation of Angola (MPLA), used the same design with a golden star in the center. Red stood for socialism and black for Africa. The star was modeled after the red star of the Soviet Union, which sponsored the MPLA. Later the explanation was made less party-specific. [0]",
        "meaning": "The red is for the blood spilt by Angolans during their independence struggles, while the black is for the continent of Africa. The symbol in the middle is of a crossed cog wheel (representing workers and industry) and machete (representing the peasantry, agricultural production and the armed struggle) with a gold star. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "yellow",
                "hex": "#F9D616"
            }
        ],
        "design": "It is split horizontally into an upper red half and a lower black half, and features a yellow half-gear crossed with a machete and crowned with a star. [0]",
        "adoptionDate": 1975,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Angola"
        ]
    }
    ,{
        "name": "Antigua and Barbuda",
        "image": "antigua-and-barbuda.svg",
        "category": "Countries",
        "history": "The flag dates from the achievement of self-government in 1967. It was the winning design in a competition that more than 600 local people entered. The designer and winner was Sir Reginald Samuel. [0]",
        "meaning": "The rising sun symbolises the dawning of a new era. The colours have different meanings, the black is for the African ancestry of the people, the blue for hope, the red for energy or dynamism of the people. The successive colouring of yellow, blue, and white (from the sun down) also stands for the sun, sea, and sand. The blue also represents the Caribbean Sea, and the V-shape is the symbol of victory. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "yellow",
                "hex": "#FCD116"
            },{
                "name": "blue",
                "hex": "#0072C6"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "The design of the National Flag is a red field with an inverted isosceles triangle based on the top edge of the field; the triangle contains a horizontal tricolor of black, light blue and white with a rising sun centered on top of the black band. [0]",
        "adoptionDate": 1967,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Antigua_and_Barbuda"
        ]
    }
    ,{
        "name": "Argentina",
        "image": "argentina.svg",
        "category": "Countries",
        "history": "The flag of Argentina was created by Manuel Belgrano during the Argentine War of Independence. While in Rosario he noticed that both the royalist and patriotic forces were using the same colors, Spain's yellow and red. After realizing this, Manuel Belgrano created the Cockade of Argentina, which was approved by the First Triumvirate on February 18, 1812. Encouraged by this success, he created a flag of the same colours nine days later. It used the colors that were used by the Criollos during the May Revolution in 1810.\n\nThe flag would be finally declared the national flag by the Congress of Tucumán on July 20, 1816, shortly after the declaration of independence. The proposal was made by the deputy Juan José Paso and the text written by the deputy of Charcas, José Serrano. On February 25, 1818, the Congress (now working at Buenos Aires) included the Sun of May in the War flag, after the proposal of deputy Chorroarín. The sun was copied after the one that the first Argentine coin featured in 1813. It was subsequently decided to keep it as part of the regular flag afterwards, and thus the sun no longer represents war.[0]",
        "meaning": "There are several theories about the exact design raised by Manuel Belgrano on February 27th, 1812. The same happens with the reason why he chose the colors (white and sky blue). [1] \n\nHowever, historians usually disregard this idea, and attribute them to loyalty towards the House of Bourbon. [0]\n\nAccording to the CIA World Factbook, the colors of the flag represent the clear skies and snow of the Andes, the sun symbol commemorates the appearance of the sun through cloudy skies on 25 May 1810 during the first mass demonstration in favor of independence. Besides the sun features are those of Inti, the Inca god of the sun. [2]",
        "ratio": "5:8",
        "colors": [
            {
                "name": "sky blue",
                "hex": "#75AADB"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "yellow",
                "hex": "#FCBF49"
            },{
                "name": "brown",
                "hex": "#843511"
            }
        ],
        "design": "A horizontal triband of light blue (top and bottom) and white with the yellow Sun of May charged in the center. [0]",
        "adoptionDate": 1812,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Argentina",
            "https://flagspot.net/flags/ar.html",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Armenia",
        "image": "armenia.svg",
        "category": "Countries",
        "history": "The Armenian Supreme Soviet adopted the current flag on 24 August 1990. On 15 June 2006, the Law on the National Flag of Armenia, governing its usage, was passed by the National Assembly of Armenia.\n\nThroughout history, there have been many variations of the Armenian flag. In ancient times, Armenian dynasties were represented by different symbolic animals displayed on their flags. \n\nAfter gaining independence, the First Republic of Armenia adopted the modern Armenian tricolor. Upon Stepan Malkhasyants's appearance in the Armenian National Council,[6] the independent Armenian government selected the colors used during the last period of Rubenid Dynasty: red, blue and yellow. An earlier prototype, which was eventually rejected, was the rainbow flag. This prototype can be seen at the Martiros Saryan House Museum in Yerevan, Armenia. They chose to replace the yellow with orange \"because it merged better with the other two colors, presenting a more pleasing composition\". [0]",
        "meaning": "According to the Constitution of the Republic of Armenia: The red emblematizes the Armenian Highland, the Armenian people's continued struggle for survival, maintenance of the Christian faith, Armenia's independence and freedom. The blue emblematizes the will of the people of Armenia to live beneath peaceful skies. The orange emblematizes the creative talent and hard-working nature of the people of Armenia. [0]\n\nHowever, the colors can be interpreted in many different ways. For example, the red symbolises the blood split by Armenians in defence of their country, orange symbolises the fertile soil of their nation and blue is for the sky. [1][2]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#D90012"
            },{
                "name": "blue",
                "hex": "#0033A0"
            },{
                "name": "orange",
                "hex": "#F2A800"
            }
        ],
        "design": "A horizontal tricolour of red, blue, and orange [0]",
        "adoptionDate": 1990,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Armenia",
            "http://www.vexilla-mundi.com/armenia_flag.html",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Australia",
        "image": "australia.svg",
        "category": "Countries",
        "history": "The flag's original design (with a six-pointed Commonwealth Star) was chosen in 1901 from entries in a competition held by the Melbourne Herald following Federation in which entries were required to include the Union Flag and Southern Cross, resulting in a British Ensign style flag, and was first flown in Melbourne on 3 September 1901, the date proclaimed as Australian National Flag Day. A slightly different design was approved by King Edward VII in 1903. The seven-pointed commonwealth star version was introduced by a proclamation dated 23 February 1908. [0]",
        "meaning": "The flag is blue with the flag of the UK in the upper hoist-side quadrant and a large seven-pointed star in the lower hoist-side quadrant known as the Commonwealth or Federation Star, representing the federation of the colonies of Australia in 1901; the star depicts one point for each of the six original states and one representing all of Australia's internal and external territories; on the fly half is a representation of the Southern Cross constellation in white with one small, five-pointed star and four larger, seven-pointed stars. [1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#00008B"
            },{
                "name": "red",
                "hex": "#FF0000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A Blue Ensign defaced with the Commonwealth Star (also known as the Federation Star) in the lower hoist quarter and the five stars of the Southern Cross in the fly half. [0]",
        "adoptionDate": 1903,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Australia",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Austria",
        "image": "austria.svg",
        "category": "Countries",
        "history": "The flag traces back to the coat of arms of the medieval Babenberg dynasty, a silver band on a red field (in heraldry: Gules a fess Argent). The origin of the Bindenschild has not been conclusively established, it possibly derived from the Styrian margraves of the Otakar noble family, who themselves may have adopted the colours from the descendants of the Carinthian duke Adalbero (ruled 1011–1035), a scion of the House of Eppenstein extinct in 1122. However, the Babenberg margrave Leopold III of Austria (1095–1136) had already been depicted with a triband shield in 1105.\n\nWhen the last Otakar Duke Ottokar IV of Styria died in 1192, the Styrian duchy was inherited by the Babenberg duke Leopold V of Austria according to the 1186 Georgenberg Pact. According to the 18th century historian Chrysostomus Hanthaler, his grandson Duke Frederick II of Austria (1230–1246), nicknamed the \"Quarrelsome\" or the \"Warlike\", the last of the Babenberg dynasty, designed a new coat of arms in red-white-red after his accession—an attempt to prevail against reluctant local nobles and to stress his autonomy towards Emperor Frederick II. The triband is first documented in a seal on a deed issued on 30 November 1230, confirming the privileges of Lilienfeld Abbey. The medieval chronicler Jans der Enikel reports that the duke appeared in a red-white-red ceremonial dress at his 1232 accolade in the Vienna Schottenstift.\n\nThe Babenberg family colors developed to the coat of arms of their Austrian possessions. After the dynasty had become extinct with Frederick's death at the 1246 Battle of the Leitha River, they were adopted by his Přemyslid successor King Ottokar II of Bohemia. Upon the 1278 Battle on the Marchfeld the colours were assumed by the victorious House of Habsburg and gradually became the coat of arms of the dynasty's Hereditary Lands within the Habsburg Monarchy. [0]",
        "meaning": "According to legend, the flag was already invented by Duke Leopold V of Austria as a consequence of his fighting during the Siege of Acre. After a fierce battle, his white surcoat was completely drenched in blood. When he removed his belt, the cloth underneath was untouched by it, revealing the combination of red-white-red. So taken was he by this singular sight that he adopted the colors and scheme as his banner. [0][1]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#ED2939"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A horizontal bicolour triband of red (top and bottom) and white. [0]",
        "adoptionDate": 1918,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Austria",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Azerbaijan",
        "image": "azerbaijan.svg",
        "category": "Countries",
        "history": "In 1828, after the last Russo-Persian War, several Khanates of the Caucasus were annexed to the Russian Empire . When the Russian Empire collapsed, Russian Azerbaijan declared its independence and joined the short-lived Transcaucasian Democratic Federative Republic, together with Georgia and Armenia. The federation was dissolved on May 26, 1918, when Georgia declared its independence as the Democratic Republic of Georgia. Both Armenia and Azerbaijan declared their independence two days later, on May 28, 1918, as the Democratic Republic of Armenia (DRA) and the Azerbaijan Democratic Republic, respectively. After gaining independence, the blue-red-green tricolour was adopted by the government of the Democratic Republic of Azerbaijan on November 9, 1918.\n\nDuring the Soviet period, Jahid Hilaloglu raised the tricolor over Baku's Maiden Tower in 1956 showing his defiance towards the system. Hilaloglu was ultimately sentenced to four years of imprisonment and his supporter Chingiz Abdullayev was institutionalized. On May 28, 1952 during the Republic Day celebrations in Germany, Mammed Amin Rasulzade raised the tricolor and asked for anyone who can be entrusted to take the flag back to Azerbaijan. Gulmirza Bagirov ultimately brought it to Azerbaijan in secret in the 1970s; this flag was hung over his house in Maştağa on January 20, 1990. During the late 1980s, unrest in Soviet Azerbaijan, the tricolor Azerbaijan Democratic Republic flag was used in demonstrations calling for independence. On November 17, 1990 on the first session of the Supreme Assembly of the Nakhichevan Autonomous Republic, the 1918 Azerbaijani flag was adopted as the national flag of the autonomous state. The first constitution since independence was adopted on November 12, 1995 after a national vote; one of the articles which described the three-color flag of the republic. [0]",
        "meaning": "The blue symbolises Azerbaijan's Turkic heritage, the red stands for progress, and the green represents Islam. [0] The crescent moon is an Islamic symbol, while the eight-pointed star represents the eight Turkic peoples of the world. [1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#00B5E2"
            },{
                "name": "red",
                "hex": "#EF3340"
            },{
                "name": "green",
                "hex": "#509E2F"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A horizontal tricolor of blue, red, and green, with a white crescent and an eight-pointed star centered on a red band [0]",
        "adoptionDate": 1918,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Azerbaijan",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Bahamas",
        "image": "bahamas.svg",
        "category": "Countries",
        "history": "The Bahamas became a crown colony of the United Kingdom within its colonial empire in 1717. Under colonial rule, the Bahama Islands used the British Blue Ensign and defaced it with the emblem of the territory. This was inspired by the ousting of the pirates, and consisted of a scene depicting a British ship chasing two pirate ships out at the high seas encircled by the motto \"Expulsis piratis restituta commercia\" (\"Pirates expelled, commerce restored\"). The emblem was designed in around 1850, but did not receive official approval until 1964.\n\nThe Bahama Islands were granted \"internal autonomy\" in 1964. After the 1972 elections, the territory started negotiations on independence. A search for a national flag began soon after, with a contest being held to determine the new design. Instead of choosing a single winning design, it was decided that the new flag was to be an amalgamation of the elements from various submissions. It was first hoisted at midnight on July 10, 1973, the day the Bahamas became an independent country. The new country also changed its name from the Bahama Islands to the Bahamas upon independence. [0]",
        "meaning": "The yellow alludes to the golden sand and the shining sun– as well as other key land-based natural resources – while the aquamarine epitomizes the sea surrounding the country (specifically the Caribbean Sea). The black symbolizes the \"strength\", \"vigor, and force\" of the Bahamian people, while the directed triangle evokes their \"enterprising and determined\" nature to cultivate the abundant natural resources on the land and in the sea. [0][1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#00ABC9"
            },{
                "name": "yellow",
                "hex": "#FAE042"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A horizontal triband of aquamarine (top and bottom) and gold with a black chevron based on the hoist side [0]",
        "adoptionDate": 1973,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Bahamas",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Bahrain",
        "image": "bahrain.svg",
        "category": "Countries",
        "history": "The earliest known flags of Bahrain were plain red. In 1820, Bahrain signed a general maritime treaty with the British Empire, and as result, a white stripe was added to the flag to signify the treaty and to distinguish it from the flags commonly used by pirates. In 1932, a serrated edge was added to the flag in order to differentiate it from those of its neighbours.\n\nThe flag originally had twenty-eight white points, but this was reduced to eight in 1972. On 14 February 2002, the number was again reduced to five, so that each of the points could stand for one of the Five Pillars of Islam. [0]",
        "meaning": "The five triangles symbolises the 5 Pillars of Islam. [0][1]",
        "ratio": "3:5",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "Red, the traditional color for flags of Persian Gulf states, with a white serrated band (five white points) on the hoist side [1]",
        "adoptionDate": 2002,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bahrain",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Bangladesh",
        "image": "bangladesh.svg",
        "category": "Countries",
        "history": "The flag is based on a similar flag used during the Bangladesh Liberation War of 1971, which had a yellow map of the country inside the red disc. In 1972 this map was deleted from the flag. One reason given was the difficulty for rendering the map correctly on both sides of the flag. [0]",
        "meaning": "The red disc represents the sun rising over Bengal, and also the blood of those who died for the independence of Bangladesh. The green field stands for the lushness of the land of Bangladesh. [0][1]",
        "ratio": "3:5",
        "colors": [
            {
                "name": "green",
                "hex": "#01796F"
            },{
                "name": "red",
                "hex": "#E11837"
            }
        ],
        "design": "A red disc on a green field. [0]",
        "adoptionDate": 1972,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bangladesh",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Barbados",
        "image": "barbados.svg",
        "category": "Countries",
        "history": "The design for the flag was created by Grantley W. Prescod and was chosen from an open competition arranged by the Barbados government. Over a thousand entries were received. [0]",
        "meaning": "The band colors represent the blue of the sea and sky and the gold of the beaches. [1]\n\nThe trident symbol was taken from Barbados' colonial badge, where the trident is shown with Britannia holding it. The broken lower part symbolises a symbolic break from its status as a colony. The three points of the trident represent the three principles of democracy – 1) government of, 2) for, and 3) by the people. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#00267F"
            },{
                "name": "yellow",
                "hex": "#FFC726"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A vertical triband of ultramarine (hoist side and fly side) and gold with a black trident-head centered on the gold band [0]",
        "adoptionDate": 1966,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Barbados",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Belarus",
        "image": "belarus.svg",
        "category": "Countries",
        "history": "The current design was introduced in 2012 by the State Committee for Standardization of the Republic of Belarus, and is adapted from a design approved in a referendum in May 1995. It is a modification of the 1951 flag used while the country was a republic of the Soviet Union. Changes made to the Soviet-era flag were the removal of symbols of communism (the hammer and sickle and the red star) and the reversal of the colors of the ornament pattern, from white on red to red on white. Since the 1995 referendum, several flags used by government officials and agencies were modeled from the national flag.\n\nThis design replaced the historical white-red-white flag used by the Belarusian People's Republic of 1918, before Belarus became a Soviet Republic, and again after it regained its independence in 1991. Opposition groups have continued to use this flag, though its display in Belarus has been restricted by the government of Belarus, which claims it was linked with Nazi collaboration during the Second World War. The white-red-white flag is used in protests against the government and by the Belarusian diaspora. [0]",
        "meaning": "The red band color recalls past struggles from oppression, the green band represents hope and the many forests of the country. [1]\n\n decorative pattern, designed in 1917 by Matrena Markevich, is displayed on the hoist of the flag (as it was previously, on the 1951 flag). The pattern, derived from local plants and flowers, is a traditional type commonly used in Belarus. These patterns are sometimes used in woven garments, most importantly in the traditional 'rushnik' – a woven towel used for ceremonial events like religious services, funerals, and other social functions. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#C8313E"
            },{
                "name": "green",
                "hex": "#4AA657"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A horizontal bicolor of red over green in a 2:1 ratio, with a red ornamental pattern on a white vertical stripe at the hoist. [0]",
        "adoptionDate": 2012,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Belarus",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Belgium",
        "image": "belgium.svg",
        "category": "Countries",
        "history": "After the death of Charlemagne, the present-day territory of Belgium (except the County of Flanders) became part of Lotharingia, which had a flag of two horizontal red stripes separated by a white stripe. The territory then passed into Spanish hands, and after the coronation of Charles V, Holy Roman Emperor yellow and red, the colours of Spain, were added. From the 16th century to the end of the 18th century, the colours of what is now Belgium were red, white and yellow. Occasionally the red cross of Burgundy was placed on the white section of the flag.\n\nDuring the period of Austrian rule, a number of different flags were tried, until the Austrian Emperor imposed the Austrian flag. The population of Brussels was opposed to this, and following the example of France, red, yellow and black cockades began to appear; those being the colours of Brabant. The colours thus correspond to the red lion of Hainaut, Limburg and Luxembourg, the yellow lion of Brabant, and the black lion of Flanders and Namur.\n\nOn August 26, 1830, the day after the rioting at the Brussels Opera and the start of the Belgian Revolution, the flag of France flew from the city hall of Brussels. The insurgents hastily replaced it with a tricolour of red, yellow and black horizontal stripes (similar to the one used during the Brabant Revolution of 1789-1790 which had established the United States of Belgium) made at a nearby fabric store. As a result, Article 193 of the Constitution of Belgium describes the colours of the Belgian nation as Red, Yellow and Black instead of using the order shown in the official flag.\n\nOn January 23, 1831, the stripes changed from horizontal to vertical and October 12 saw the flag attain its modern form, with the black placed at the hoist side of the flag. It is suggested that the change occurred to more clearly distinguish the flag of Belgium from the Dutch flag (which also has three horizontal stripes) - especially important during naval battles. [0]",
        "meaning": "The vertical design was based on the flag of France. The colors are those of the arms of the duchy of Brabant (yellow lion with red claws and tongue on a black field). [1]",
        "ratio": "13:15",
        "colors": [
            {
                "name": "black",
                "hex": "#000000"
            },{
                "name": "yellow",
                "hex": "#FFE936"
            },{
                "name": "red",
                "hex": "#FF0F21"
            }
        ],
        "design": "A vertical tricolour of black, yellow, and red. [0]",
        "adoptionDate": 1831,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Belgium",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
    ,{
        "name": "Belize",
        "image": "belize.svg",
        "category": "Countries",
        "history": "From 1950 onward an unofficial national flag was in use. It was blue, with the coat of arms on a white disc in the centre (sometimes a blank white circle was used as the coat of arms was difficult to draw).\n\nIn 1981, Belize gained its independence and a competition was held to design a national flag for the country. The winning submission consisted of the unofficial national flag used by the People's United Party with a red border added to all four sides. This was changed to a red border on just the top and bottom before the design was officially adopted. [0]",
        "meaning": "The coat of arms features a shield flanked by two workers in front of a mahogany tree with the related motto SUB UMBRA FLOREO (I Flourish in the Shade) on a scroll at the bottom, all encircled by a green garland of 50 mahogany leaves; the colors are those of the two main political parties: blue for the PUP and red for the UDP. Various elements of the coat of arms - the figures, the tools, the mahogany tree, and the garland of leaves - recall the logging industry that led to British settlement of Belize. [1]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#003F87"
            },{
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A royal blue field with two red narrow stripes along the top and the bottom edges and a large white disk in the center bearing the National Coat of Arms of Belize [0]",
        "adoptionDate": 1981,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Belize",
            "https://www.cia.gov/library/publications/the-world-factbook/docs/flagsoftheworld.html"
        ]
    }
]