[
    {
        "name": "Afghanistan",
        "image": "afghanistan.jpg",
        "category": "Countries",
        "history": "Afghanistan has had 20 different flags since the first flag when the Hotaki dynasty which made Afghanistan independent was established in 1709.\n\nThe current flag was adopted by the Islamic Republic of Afghanistan in 2004. This flag is similar to the one flown in Afghanistan during the monarchy between 1930 and 1973. The difference is the addition of the shahadah at the top of the coat of arms (seen in yellow) in the center. This flag consists of three stripes of the colors black, red, and green. This has been present on most flags of Afghanistan in the last twenty years. The center emblem is the classical emblem of Afghanistan with a mosque with its mihrab facing Mecca. [0]",
        "meaning": "According to the website of the Embassy of Afghanistan in Washington, DC: Black represents the occupation of foreigners, the Red represents the blood of freedom fighters, and the Green represents freedom and Islam. [1]\n\nAntoher meaning could be: black appeared representing the previous (monochrome) field of Afghan flags, which in turn represented the sovereign; red was possibly introduced by emir, later king, Aman Allah as a sign of modernity and progress, copied from the Soviet flag as happened also with the 1928-1929 emblem; green stood for Islam. [2]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "black",
                "hex": "#000000"
            },{
                "name": "red",
                "hex": "#FE0000"
            },{
                "name": "green",
                "hex": "#009900"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A vertical tricolor of black, red, and green charged in the center with the national emblem [0]",
        "adoptionDate": 2004,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Afghanistan",
            "http://www.embassyofafghanistan.org/page/afghanistan-in-brief",
            "https://flagspot.net/flags/af.html#col"
        ]
    }
    ,{
        "name": "Albania",
        "image": "albania.svg",
        "category": "Countries",
        "history": "Elements of the flag's design such as the double-headed eagle were borrowed from the banner of the Byzantine Empire (specifically the emblem of the Palaiologoi dynasty). The eagle was used for heraldic purposes in the Late Middle Ages by a number of noble families in Albania (it is said that Skanderbeg used it on his flag) and became the symbol of the Albanians. The Kastrioti's coat of arms, depicting a black double-headed eagle on a red field, became famous when he led a revolt against the Ottoman Empire resulting in the independence of Albania from 1443 to 1479. This was the flag of the League of Lezhë, which was the first unified Albanian state in the Middle Ages.\n\nThe symbol of the double-headed eagle was re-used by Albanian nationalists during the 19th and early 20th centuries as a symbol of their campaign for their country's independence from the Ottoman Empire. On 28 November 1912, the Albanian Declaration of Independence was proclaimed in Vlora and the flag, raised by Ismail Qemal, was adopted as the symbol of the new nation. [0]",
        "meaning": "The red stands for bravery, strength and valor, while the double-headed eagle represents the sovereign state of Albania located in the Balkans. [0]",
        "ratio": "5:7",
        "colors": [
            {
                "name": "red",
                "hex": "#E41E20"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A silhouette of an open-winged bicephalated eagle on a red field. [0]",
        "adoptionDate": 1992,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Albania"
        ]
    }
    ,{
        "name": "Algeria",
        "image": "algeria.svg",
        "category": "Countries",
        "history": "The flag's design is derived from the standard of Emir Abdel Kadir in the 19th century which consisted of two equal vertical bands, green and white, as well as being inspired from the flag of the Algerian Regency from the 16th to the 19th century, which consisted of a white crescent and star on a red background (the same as the modern flag of Turkey; the Algerian Regency was an autonomous vassal of the Ottoman Empire). [0]",
        "meaning": "The white color represents peace; the green represents Islam; the red, the blood of those killed fighting for independence in the Algerian War (1954 to 1962) and the star and crescent represent Islam. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "green",
                "hex": "#006233"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#D21034"
            }
        ],
        "design": "A red star and crescent centered on a vertical bicolor of green and white. [0]",
        "adoptionDate": 1962,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Algeria"
        ]
    }
    ,{
        "name": "Andorra",
        "image": "andorra.svg",
        "category": "Countries",
        "history": "The national flag of the Principality of Andorra was adopted in 1866. The design is related to the flags of France, Catalonia [1] and the old County of Foix, the lands historically linked with the small country. A flag of three bars is similar to that of the French Tricolor, while the pattern of a wider middle stripe can be noted on the Catalan flag (as the royal symbol of the Crown of Aragon) and on the flag of the County of Foix (currently in France). The blue and red of the Andorran flag are also found on the French flag, with red and yellow also being the principal colors of the other two flags. From 1806 to 1866, Andorra's flag was a vertical bi-color of yellow and red. The motto in the coat of arms in the middle stripe Virtus Unita Fortior means \"Virtue United is Stronger\". [0]",
        "meaning": "The blue and red colors are similar to the French flag, while the yellow and red are related to Catalonia.",
        "ratio": "7:10",
        "colors": [
            {
                "name": "blue",
                "hex": "#0018A8"
            },{
                "name": "yellow",
                "hex": "#FEDF00"
            },{
                "name": "red",
                "hex": "#D0103A"
            }
        ],
        "design": "A vertical tricolour of blue, yellow and red with the national coat of arms centred on the middle stripe. The middle stripe is one eighth thicker than the outer bands. [0]",
        "adoptionDate": 1866,
        "related": [],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Andorra",
            "https://flagspot.net/flags/ad.html"
        ]
    }
    ,{
        "name": "Angola",
        "image": "angola.svg",
        "category": "Countries",
        "history": "",
        "meaning": "The red is for the blood spilt by Angolans during their independence struggles, while the black is for the continent of Africa. The symbol in the middle is of a crossed cog wheel (representing workers and industry) and machete (representing the peasantry, agricultural production and the armed struggle) with a gold star. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": ""
            },{
                "name": "black",
                "hex": ""
            },{
                "name": "yellow",
                "hex": ""
            }
        ],
        "design": "It is split horizontally into an upper red half and a lower black half, and features a yellow half-gear crossed with a machete and crowned with a star. [0]",
        "adoptionDate": 1975,
        "related": [
            ""
        ],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Angola"
        ]
    }
    ,{
        "name": "Antigua and Barbuda",
        "image": "antigua-and-barbuda.svg",
        "category": "Countries",
        "history": "",
        "meaning": "The rising sun symbolises the dawning of a new era. The colours have different meanings, the black is for the African ancestry of the people, the blue for hope, the red for energy or dynamism of the people. The successive colouring of yellow, blue, and white (from the sun down) also stands for the sun, sea, and sand. The blue also represents the Caribbean Sea, and the V-shape is the symbol of victory. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": ""
            },{
                "name": "black",
                "hex": ""
            },{
                "name": "yellow",
                "hex": ""
            },{
                "name": "blue",
                "hex": ""
            },{
                "name": "white",
                "hex": ""
            }
        ],
        "design": "The design of the National Flag is a red field with an inverted isosceles triangle based on the top edge of the field; the triangle contains a horizontal tricolor of black, light blue and white with a rising sun centered on top of the black band. [0]",
        "adoptionDate": 1967,
        "related": [
            ""
        ],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Antigua_and_Barbuda"
        ]
    }
    ,{
        "name": "Argentina",
        "image": "argentina.svg",
        "category": "Countries",
        "history": "",
        "meaning": "",
        "ratio": "5:8",
        "colors": [
            {
                "name": "sky blue",
                "hex": ""
            },{
                "name": "white",
                "hex": ""
            },{
                "name": "yellow",
                "hex": ""
            }
        ],
        "design": "A horizontal triband of light blue (top and bottom) and white with the yellow Sun of May charged in the center. [0]",
        "adoptionDate": 1812,
        "related": [
            ""
        ],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Argentina"
        ]
    }
    ,{
        "name": "Armenia",
        "image": "armenia.svg",
        "category": "Countries",
        "history": "",
        "meaning": "The red emblematizes the Armenian Highland, the Armenian people's continued struggle for survival, maintenance of the Christian faith, Armenia's independence and freedom. The blue emblematizes the will of the people of Armenia to live beneath peaceful skies. The orange emblematizes the creative talent and hard-working nature of the people of Armenia. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": ""
            },{
                "name": "blue",
                "hex": ""
            },{
                "name": "orange",
                "hex": ""
            }
        ],
        "design": "A horizontal tricolour of red, blue, and orange [0]",
        "adoptionDate": 1990,
        "related": [
            ""
        ],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Armenia"
        ]
    }
    ,{
        "name": "Australia",
        "image": "australia.svg",
        "category": "Countries",
        "history": "",
        "meaning": "",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": ""
            },{
                "name": "red",
                "hex": ""
            },{
                "name": "white",
                "hex": ""
            }
        ],
        "design": "A Blue Ensign defaced with the Commonwealth Star (also known as the Federation Star) in the lower hoist quarter and the five stars of the Southern Cross in the fly half. [0]",
        "adoptionDate": 1903,
        "related": [
            ""
        ],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Australia"
        ]
    }
    ,{
        "name": "Austria",
        "image": "austria.svg",
        "category": "Countries",
        "history": "",
        "meaning": "",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": ""
            },{
                "name": "white",
                "hex": ""
            }
        ],
        "design": "A horizontal bicolour triband of red (top and bottom) and white. [0]",
        "adoptionDate": 1918,
        "related": [
            ""
        ],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Austria"
        ]
    }
    ,{
        "name": "Azerbaijan",
        "image": "azerbaijan.svg",
        "category": "Countries",
        "history": "",
        "meaning": "The blue symbolises Azerbaijan's Turkic heritage, the red stands for progress, and the green represents Islam. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": ""
            },{
                "name": "red",
                "hex": ""
            },{
                "name": "green",
                "hex": ""
            },{
                "name": "white",
                "hex": ""
            }
        ],
        "design": "A horizontal tricolor of blue, red, and green, with a white crescent and an eight-pointed star centered on a red band [0]",
        "adoptionDate": 1918,
        "related": [
            ""
        ],
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Azerbaijan"
        ]
    }
]