[
    {
        "name": "Christmas Island",
        "image": "christmas-island.svg",
        "category": "Dependent Territories",
        "history": "The flag of Christmas Island was unofficially adopted in 1986 after being chosen the winner in a competition for a flag for the territory. It was designed by Tony Couch of Sydney, Australia. The flag was made official on Australia Day, 2002 when the administrator of the territory, Bill Taylor, presented the flag to the Christmas Island Shire. [0]",
        "meaning": "Green and blue are intended to represent the land and sea respectively. The golden bosun bird is considered to be a symbol of the Island. The disc itself was originally only included to offset the green color of the map, but has become linked to the mining industry. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#0021AD"
            },{
                "name": "green",
                "hex": "#1C8A42"
            },{
                "name": "yellow",
                "hex": "#FFC639"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "Blue/green diagonal bicolour charged with a southern cross of four seven-pointed white stars and one smaller five-pointed white star on the blue half, a golden bosun bird in gold on the green half, and a gold circle in the centre containing the shape of the island in green. [0]",
        "adoptionDate": 2002,
        "related": {
            "country": [
                {
                    "name": "Australia",
                    "image": "australia.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Christmas_Island"
        ]
    }
    ,{
        "name": "Cocos Islands",
        "image": "cocos-islands.svg",
        "category": "Dependent Territories",
        "history": "The flag of the Cocos (Keeling) Islands was first created in 2003; the flag was adopted on April 6, 2004. It was designed by Mohd Isa Minkom. [0]",
        "meaning": "The palm tree represents the islands' tropical flora; the colours are Australia's national colours; the crescent represents Islam, the religion of the Cocos Malays who make up a majority of the population; and the Southern Cross is a symbol of Australia and the Southern Hemisphere. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "green",
                "hex": "#008000"
            },{
                "name": "yellow",
                "hex": "#FFE000"
            },{
                "name": "brown",
                "hex": "#802000"
            }
        ],
        "design": "Green, with a palm tree on a gold disc in the canton, a gold crescent in the centre of the flag and a gold southern cross in the fly. [0]",
        "adoptionDate": 2004,
        "related": {
            "country": [
                {
                    "name": "Australia",
                    "image": "australia.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Cocos_(Keeling)_Islands"
        ]
    }
    ,{
        "name": "Norfolk Island",
        "image": "norfolk-island.svg",
        "category": "Dependent Territories",
        "history": "The flag of Norfolk Island was approved by the Norfolk Island Council on 6 June 1979. It became the official flag on the commencement date of the Norfolk Island Flag and Public Seal Act 1979 on 17 January 1980.\n\nIt is similar to the flag of Canada (upon which it was based), with its use of only two colours, and incorporating a prominent local floral symbol in the middle. The flag bears a striking resemblance to the flag of Lebanon (which also features a green tree), the flag of Nigeria (a plain vertical green and white triband), and the 1968–1979 flag of Rhodesia (a green and white triband with the state's coat of arms on the white band). [0]",
        "meaning": "The Norfolk Island Pine (Araucaria heterophylla) is endemic to the Norfolk Island. [0][1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "green",
                "hex": "#007934"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "Vertical triband green-white-green charged with the Norfolk Island Pine in the central white stripe. The central stripe is wider than the two outer stripes, the ratio being 7:9:7. [0]",
        "adoptionDate": 1980,
        "related": {
            "country": [
                {
                    "name": "Australia",
                    "image": "australia.svg"
                }
            ],
            "similar": [
                {
                    "name": "Canada",
                    "image": "canada.svg"
                },{
                    "name": "Lebanon",
                    "image": "lebanon.svg"
                },{
                    "name": "Nigeria",
                    "image": "nigeria.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Norfolk_Island",
            "https://flagspot.net/flags/nf.html"
        ]
    }
    ,{
        "name": "Hong Kong",
        "image": "hong-kong.svg",
        "category": "Dependent Territories",
        "history": "Before Hong Kong's transfer of sovereignty, between 20 May 1987 and 31 March 1988, a contest was held amongst Hong Kong residents to help choose a flag for post-colonial Hong Kong, with 7,147 design submissions, in which 4,489 submissions were about flag designs. Architect Tao Ho was chosen as one of the panel judges to pick Hong Kong's new flag. He recalled that some of the designs had been rather funny and with political twists: \"One had a hammer and sickle on one side and a dollar sign on the other.\" Some designs were rejected because they contained copyrighted materials, for example, the emblem of Urban Council, Hong Kong Arts Festival and Hong Kong Tourism Board. Six designs were chosen as finalists by the judges, but were all later rejected by the PRC. Ho and two others were then asked by the PRC to submit new proposals.\n\nLooking for inspiration, Ho wandered into a garden and picked up a Bauhinia blakeana flower. He observed the symmetry of the five petals, and how their winding pattern conveyed to him a dynamic feeling. This led him to incorporate the flower into the flag to represent Hong Kong. The design was adopted on 4 April 1990 at the Third Session of the Seventh National People's Congress, and the flag was first officially hoisted seconds after midnight on 1 July 1997 in the handover ceremony marking the transfer of sovereignty. It was hoisted together with the national PRC flag, while the Chinese national anthem, \"March of the Volunteers\" was played. The Union Flag and the colonial Hong Kong flag were lowered seconds before midnight. [0]",
        "meaning": "The colour itself is significant; red is a festive colour for the Chinese people, used to convey a sense of celebration and nationalism. Moreover, the red colour is identical to that used in the national PRC flag, chosen to signify the link re-established between post-colonial Hong Kong and China. The position of red and white on the flag symbolises the \"one country two systems\" political principle applied to the region. The stylised rendering of the Bauhinia blakeana flower, a flower discovered in Hong Kong, is meant to serve as a harmonising symbol for this dichotomy.[6] The five stars of the Chinese national flag, representing the Communist Party and Mao Zedong's four classes (proletarian workers, agricultural peasants, petty bourgeoisie and capitalists), are replicated on the petals of the flower. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#FF0000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A stylised, white, five-petal Bauhinia blakeana flower in the centre of a red field. [0]",
        "adoptionDate": 1990,
        "related": {
            "country": [
                {
                    "name": "China",
                    "image": "china.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Hong_Kong"
        ]
    }
    ,{
        "name": "Macau",
        "image": "macau.svg",
        "category": "Dependent Territories",
        "history": "Prior to the handover of Macau to the People's Republic of China by the Portuguese Republic in 1999, Macau officially used only the Portuguese flag, in contrast to Hong Kong, which, under British rule, used a defaced Blue Ensign as its flag, alongside the Union Jack. In 1967, there were proposals to give each overseas province its own flag, consisting of the Portuguese flag with the local coat of arms, but none was ever adopted. [0]",
        "meaning": "The lotus was chosen as the floral emblem of Macau. The Governor Nobre de Carvalho Bridge is a bridge linking the Macau Peninsula and the island of Taipa. The bridge is one of the most recognisable landmarks for the territory. The water beneath the lotus and the bridge symbolise Macau's position as a port and its role played in the territory. The five five-pointed stars echo the design of the flag of the People's Republic of China, symbolising the relationship Macau has with its sovereign state. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "green",
                "hex": "#00785E"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "yellow",
                "hex": "#FBD116"
            }
        ],
        "design": "Light green with a lotus flower above the stylised Governor Nobre de Carvalho Bridge and water in white, beneath an arc of five gold, five-pointed stars. [0]",
        "adoptionDate": 1993,
        "related": {
            "country": [
                {
                    "name": "China",
                    "image": "china.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Macau"
        ]
    }
    ,{
        "name": "Faroe Islands",
        "image": "faroe-islands.svg",
        "category": "Dependent Territories",
        "history": "The modern Faroese flag was devised in 1919 by Jens Oliver Lisberg and others while they were studying in Copenhagen. The first time Merkið was raised in the Faroe Islands was on 22 June that year in Fámjin on the occasion of a wedding. On 25 April, 1940, the British occupation government approved the flag for use by Faroese vessels, during the tenure of Carl Aage Hilbert as Danish prefect. April 25 is still celebrated as Flaggdagur and it is a national holiday. With the Home Rule Act of 23 March, 1948, the flag was recognized by the Danish Government as the national flag of the Faroes. The original flag is displayed in the church of Fámjin in Suðuroy. [0]",
        "meaning": "White symbolises the creators of the flag, the foam of the sea and the pure, radiant sky of the Faroe Islands, while the old Faroese blue and red colours are reminiscent of other Scandinavian and Nordic flags; representing the Faroe Islands' bonds with other Nordic countries. [0]",
        "ratio": "5:7",
        "colors": [
            {
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "blue",
                "hex": "#0065BD"
            },{
                "name": "red",
                "hex": "#ED2939"
            }
        ],
        "design": "A blue-fimbriated red Nordic cross on a white field. [0]",
        "adoptionDate": 1940,
        "related": {
            "country": [
                {
                    "name": "Denmark",
                    "image": "denmark.svg"
                }
            ],
            "similar": [
                {
                    "name": "Denmark",
                    "image": "denmark.svg"
                },{
                    "name": "Finland",
                    "image": "finland.svg"
                },{
                    "name": "Iceland",
                    "image": "iceland.svg"
                },{
                    "name": "Norway",
                    "image": "norway.svg"
                },{
                    "name": "Sweden",
                    "image": "sweden.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Faroe_Islands"
        ]
    }
    ,{
        "name": "Greenland",
        "image": "greenland.svg",
        "category": "Dependent Territories",
        "history": "Greenland first entertained the idea of a flag of its own in 1973 when five Greenlanders proposed a green, white and blue flag. The following year, a newspaper solicited eleven design proposals (all but one of which was a Nordic cross) and polled the people to determine the most popular. The flag of Denmark was preferred to the others. Little came of this effort.\n\nIn 1978, Denmark granted home rule to Greenland, making it an equal member of the Danish Realm. The home rule government held an official call for flag proposals, receiving 555 (of which 293 were submitted by Greenlanders).\n\nThe deciding committee came to no consensus, so more proposals were solicited. Finally the present red-and-white design by Christiansen narrowly won over a green-and-white Nordic cross by a vote of fourteen to eleven. Christiansen's red-and-white flag was officially adopted on 21 June 1985. [0]",
        "meaning": "The colours of the flag are the same as those of the Dannebrog, symbolising Greenland's place in the Danish realm. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#D00C33"
            }
        ],
        "design": "A horizontal bicolor of white and red, with a counterchanged disk slightly off-centre towards the hoist. [0]",
        "adoptionDate": 1985,
        "related": {
            "country": [
                {
                    "name": "Denmark",
                    "image": "denmark.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Greenland"
        ]
    }
    ,{
        "name": "French Guiana",
        "image": "french-guiana.svg",
        "category": "Dependent Territories",
        "history": "On 29 January 2010, the General Council (departmental council) of the overseas department of French Guiana unilaterally adopted a flag for the department of French Guiana. This has not been recognized by the superior regional council. Moreover, only the French flag is officially recognized by the French constitution as the national flag.\n\nThe flag is identical with the one of pro-independence trade union UGT and also MDES. [0]",
        "meaning": "Green represents the forests, yellow represents gold and other minerals of the region, while the red star represents socialism. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "green",
                "hex": "#078930"
            },{
                "name": "yellow",
                "hex": "#FCDD09"
            },{
                "name": "red",
                "hex": "#DA121A"
            }
        ],
        "design": "Divided diagonally from the upper hoist-side corner to the lower fly-side corner: the upper triangle is green and the lower triangle is yellow. A red five-point star is charged in the center of the flag.",
        "adoptionDate": 2010,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_French_Guiana"
        ]
    }
    ,{
        "name": "French Polynesia",
        "image": "french-polynesia.svg",
        "category": "Dependent Territories",
        "history": "The flag of French Polynesia was adopted in 1984.\n\nAll vessels registered in French Polynesia have to fly the French flag, even for the small ships sailing between the islands, as there is no official French Polynesian civil or state ensign. [0]",
        "meaning": "Red and white are traditional Polynesian colors. The five stars on the Polynesian canoe symbolise the five island groups. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "yellow",
                "hex": "#FF9C10"
            },{
                "name": "blue",
                "hex": "#083D9C"
            }
        ],
        "design": "Two red horizontal bands encase a wide white band in a 1:2:1 ratio; centered on the white band is a disk with a blue and white wave pattern depicting the sea on the lower half and a gold and white ray pattern depicting the sun on the upper half; a Polynesian canoe rides on the wave pattern; the canoe has a crew of five represented by five stars. [0]",
        "adoptionDate": 1984,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_French_Polynesia"
        ]
    }
    ,{
        "name": "French Southern and Antarctic Territories",
        "image": "french-southern-and-antarctic-lands.svg",
        "category": "Dependent Territories",
        "history": "The flag was adopted in 2007. [0]",
        "meaning": "The coat of arms consists of five stars and the letters \"TAAF\" (from the French name of the territory, Terres australes et antarctiques françaises). [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#002395"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#ED2939"
            }
        ],
        "design": "French tricolor in the canton together with the Commissioner's arms. [0]",
        "adoptionDate": 2007,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flags_of_Antarctica#Ad.C3.A9lie_Land.2FFrench_Southern_and_Antarctic_Territories"
        ]
    }
    ,{
        "name": "Guadeloupe",
        "image": "guadeloupe.svg",
        "category": "Dependent Territories",
        "history": "Guadeloupe, an overseas region and department of France located in the Caribbean, has no flag with official status other than the French national flag. [0]",
        "meaning": "The blue stripe with the fleus-de-lis represent France, wherehas the yellow sun and green sugar cane are based on the coat of arms of Guadeloupe's capital Basse-Terre. [0]",
        "ratio": "",
        "colors": [
            {
                "name": "blue",
                "hex": "#002488"
            },{
                "name": "yellow",
                "hex": "#FCDD09"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "green",
                "hex": "#008000"
            }
        ],
        "design": "Black or red field with a yellow sun and a green sugar cane, and a blue stripe with yellow fleurs-de-lis on the top. [0]",
        "adoptionDate": 1999,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Guadeloupe",
            "https://flagspot.net/flags/gp.html"
        ]
    }
    ,{
        "name": "Martinique",
        "image": "martinique.svg",
        "category": "Dependent Territories",
        "history": "The snake flag of Martinique has no official status on the island. It is a historical flag dating from an edict issued 4 August 1766, specifying that vessels of the French Colony of Martinique and Saint Lucia should fly a version of the French ensign, which at the time was a white cross on a blue field, with L-shaped (for Lucia) snakes in each quarter of the cross. The same design is used for the lesser coat of arms. [0]",
        "meaning": "The snakes are fer-de-lance vipers (Bothrops lanceolatus, French trigonocéphale) native to Martinique. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#21428E"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "Blue field quartered by a white cross and with a white, L-shaped snake in each canton. [1]",
        "adoptionDate": 1766,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Martinique",
            "https://flagspot.net/flags/mq.html"
        ]
    }
    ,{
        "name": "Mayotte",
        "image": "mayotte.svg",
        "category": "Dependent Territories",
        "history": "The unofficial local flag and coat of arms of Mayotte represents the French overseas department of Mayotte. [0]",
        "meaning": "The coat of arms consists of a shield with a cloud design, a sideways crescent and flowers in blue and red segments. The supporters of the shield are seahorses. The motto, placed in a grey ribbon, reads \"RA HACHIRI\" – We are vigilant in Shimaore (Comorian). [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "grey",
                "hex": "#DFDFDF"
            },{
                "name": "blue",
                "hex": "#171796"
            },{
                "name": "red",
                "hex": "#D42E12"
            },{
                "name": "yellow",
                "hex": "#E9D315"
            }
        ],
        "design": "A white field with the archipelago's coat of arms below an inscription \"MAYOTTE\" in red capitals. [0]",
        "adoptionDate": 1976,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Mayotte",
            "https://flagspot.net/flags/yt.html"
        ]
    }
    ,{
        "name": "New Caledonia",
        "image": "new-caledonia.svg",
        "category": "Dependent Territories",
        "history": "In 2008 the government of New Caledonia debated the introduction of an official regional flag and anthem, as required by the Accord de Nouméa. A flag in fairly widespread unofficial use was the flag of the Kanak and Socialist National Liberation Front (FLNKS), a political party favoring independence for New Caledonia, but the French tricolor would remain the only flag used for the next two years.\n\nIn July 2010 the Congress of New Caledonia voted in favour of a motion to fly the Kanak flag alongside the French tricolor in the territory. On 17 July 2010, French Prime minister François Fillon took part in a ceremony in Nouméa where the FLNKS flag was hoisted alongside the French tricolor. [0]",
        "meaning": "The blue symbolizes both the sky and more importantly the ocean surrounding New Caledonia. The red symbolizes the blood shed by the Kanaks in their struggle for independence, socialism, and unity. The green symbolizes the land itself and by extension the ancestors buried within it. The yellow disc is a representation of the sun and the symbol upon it consists of a flèche faitière, a kind of arrow which adorns the roofs of Kanak houses thrust through tutut shells. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#0035AD"
            },{
                "name": "red",
                "hex": "#ED4135"
            },{
                "name": "green",
                "hex": "#009543"
            },{
                "name": "yellow",
                "hex": "#FAE600"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A horizontal tricolour of blue, red, and green charged with a yellow disc fibrated black and defaced with a vertical symbol, also black. [0]",
        "adoptionDate": 2010,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_New_Caledonia"
        ]
    }
    ,{
        "name": "Réunion",
        "image": "réunion.svg",
        "category": "Dependent Territories",
        "history": "The Vexillological Association of Réunion selected a flag in 2003. It depicts the volcano of Fournaise, bedecked by gold sunbeams. It was designed in 1974 by Guy Pignolet who called it Lö Mahavéli but it really started to be promoted once the association chose it in 2003. It doesn't have official recognition but since 2014, it is flying on top of many public buildings after several city councils have taken the decision to do so.\n\nIndependentists and nationalists of Reunion also have their flag (green, yellow, red) which was created in 1986. [0]",
        "meaning": "Red for the volcano and strength, blue for the sky and sweetness, yellow for the sun and clearness. [1]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#3366FF"
            },{
                "name": "red",
                "hex": "#FF0000"
            },{
                "name": "yellow",
                "hex": "#FFFF00"
            }
        ],
        "design": "Blue field charged with a red triangle from the base to the middle of the flag and five broadening rays extending from the centre to the edge of the field.",
        "adoptionDate": 2003,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Réunion",
            "http://www.crwflags.com/fotw/flags/re!.html"
        ]
    }
    ,{
        "name": "Saint Barthélemy",
        "image": "saint-barthelemy.svg",
        "category": "Dependent Territories",
        "history": "The flag of Saint Barthélemy is the French tricolor. This is because Saint Barthélemy is a self-governing overseas collectivity of France. An unofficial flag of Saint-Barthélemy consisting of the island's coat of arms centered on a white field is also used on the island. [0]",
        "meaning": "The coat of arms of Saint-Barthélemy is a shield divided into three horizontal stripes (parted per fess), three gold fleurs-de-lis on blue, above a white Maltese cross on red, over three gold crowns on blue, and \"Ouanalao\" is what the indigenous people called the island. On top of the shield is a mural crown.\n\nThe fleurs-de-lis, Maltese Cross, and gold crowns are heraldic reminders of the island's history as a colony ruled by first the Kingdom of France, then the Knights Hospitaller and in turn the Kingdom of Sweden. Eventually, the island returned to French rule. [0]",
        "ratio": "",
        "colors": [
            {
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "yellow",
                "hex": "#EACE24"
            },{
                "name": "blue",
                "hex": "#1353B4"
            },{
                "name": "red",
                "hex": "#CE0F25"
            },{
                "name": "beige",
                "hex": "#F6E4BE"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A white field with the island's coat of arms centered. [0]",
        "adoptionDate": 1977,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_and_coat_of_arms_of_Saint_Barth%C3%A9lemy"
        ]
    }
    ,{
        "name": "Saint Pierre and Miquelon",
        "image": "saint-pierre-and-miquelon.svg",
        "category": "Dependent Territories",
        "history": "In 1982 an unofficial local flag was designed, based on the Collectivity's coat of arms. The flag was likely designed by André Paturel, a local business owner. [0]",
        "meaning": "The flag is blue with a yellow ship, said to be the Grande Hermine, which brought Jacques Cartier to Saint-Pierre on 15 June 1536. Three square fields placed along the hoist recall the origin of most inhabitants of the islands, from top to bottom, Basques, Bretons, and Normans. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#0092C8"
            },{
                "name": "yellow",
                "hex": "#FFCF00"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#DC241F"
            },{
                "name": "green",
                "hex": "#009543"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "red",
                "hex": "#CA0000"
            },{
                "name": "yellow",
                "hex": "#FFCD00"
            }
        ],
        "design": "Blue with a yellow ship and three square fields placed along the hoist. [0]",
        "adoptionDate": 1982,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Saint_Pierre_and_Miquelon"
        ]
    }
    ,{
        "name": "Wallis and Futuna",
        "image": "wallis-and-futuna.svg",
        "category": "Dependent Territories",
        "history": "The official flag of Wallis and Futuna is the French national flag, as it is a French territory. Wallis and Futuna has a locally used unofficial flag which bears the French flag in the canton. [0]",
        "meaning": "See History.",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#ED2939"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "blue",
                "hex": "#002395"
            }
        ],
        "design": "Red saltire on a white square, which in turn is placed on a red field (alternatively, a larger white cross pattée is used). The cross is shifted a little off centre toward the fly (the cross pattée is also shifted slightly downwards); the flag of France outlined in white on two sides is in the upper hoist quadrant. [0]",
        "adoptionDate": 1985,
        "related": {
            "country": [
                {
                    "name": "France",
                    "image": "france.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Wallis_and_Futuna"
        ]
    }
    ,{
        "name": "Aruba",
        "image": "aruba.svg",
        "category": "Dependent Territories",
        "history": "Aruba's national flag was adopted on March 18, 1976. [0]",
        "meaning": "The blue field represents the sky, the sea, peace, hope, Aruba's future and its ties to the past. The two narrow stripes \"suggest the movement toward status aparte\". The other \"industry, all the minerals (gold and phosphates in the past, petroleum in the early 20th century)\". [1] In addition to sun, gold, and abundance, the yellow is also said to represent wanglo flowers.\n\nThe star has particularly complex symbolism. It is vexillologically unusual in having four points, representing the four cardinal directions. These refer in turn to the many countries of origin of the people of Aruba. The star also represents the island itself: a land of often red soil bordered by white beaches in a blue sea. The red colour also represents blood shed by Arubans, the Indian inhabitants, during the French pass war; patriotic love. The white also represents purity, honesty and the white beaches of Aruba. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#4189DD"
            },{
                "name": "yellow",
                "hex": "#F9D616"
            },{
                "name": "red",
                "hex": "#D21034"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "The design consists of a field of light blue, two narrow parallel horizontal yellow stripes in the bottom half, and a four-pointed white-fimbriated red star in the canton. [0]",
        "adoptionDate": 1976,
        "related": {
            "country": [
                {
                    "name": "Netherlands",
                    "image": "netherlands.svg"
                }
            ],
            "similar": [
                {
                    "name": "Curaçao",
                    "image": "curaçao.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Aruba"
        ]
    }
    ,{
        "name": "Curaçao",
        "image": "curaçao.svg",
        "category": "Dependent Territories",
        "history": "The flag was designed in 1984 by Martin den Dulk. Curaçao had organized a small competition to choose the annual flag that will represent them. Martin den Dulk was one of the many participants but his interpretation of the flag won the judges over. His design won first place and his flag became the flag of Curaçao.\n\nAfter Aruba's adoption of its own flag (while still part of the Netherlands Antilles), Curaçao received approval for a flag in 1979. Two thousand designs were submitted to a special council; ten were shortlisted, and the council decided on 29 November 1982. With some modifications, the flag was adopted on 2 July 1984. [0]",
        "meaning": "The blue symbolises the sea and sky (the bottom and top blue sections, respectively) divided by a yellow stroke representing the bright sun which bathes the island. The two stars represent Curaçao and Klein Curaçao, but also 'Love and Happiness'. The five points on each star symbolise the five continents from which Curaçao's people come. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#002B7F"
            },{
                "name": "yellow",
                "hex": "#F9E814"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "The flag is a blue field with a horizontal yellow stripe slightly below the midline and two white, five-pointed stars in the canton.  [0]",
        "adoptionDate": 1984,
        "related": {
            "country": [
                {
                    "name": "Netherlands",
                    "image": "netherlands.svg"
                }
            ],
            "similar": [
                {
                    "name": "Aruba",
                    "image": "aruba.svg"
                },{
                    "name": "Nauru",
                    "image": "nauru.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Curaçao"
        ]
    }
    ,{
        "name": "Sint Maarten",
        "image": "sint-maarten.svg",
        "category": "Dependent Territories",
        "history": "The flag of Sint Maarten is the national flag of Sint Maarten, a country within the Kingdom of the Netherlands occupying the southern half of the island of Saint Martin. The flag, designed by Roselle Richardson, was officially adopted on 13 June 1985. [0]",
        "meaning": "The red symbolises war and bloodshed, the blue peace and assurance of pardon, and the white purity and faith. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#DC171D"
            },{
                "name": "blue",
                "hex": "#012A87"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "The flag is a horizontal bicolour of red and blue with the coat of arms of Sint Maarten on a white chevron. [0]",
        "adoptionDate": 1985,
        "related": {
            "country": [
                {
                    "name": "Netherlands",
                    "image": "netherlands.svg"
                }
            ],
            "similar": [
                {
                    "name": "Philippines",
                    "image": "philippines.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Sint_Maarten"
        ]
    }
    ,{
        "name": "Bonaire",
        "image": "bonaire.svg",
        "category": "Dependent Territories",
        "history": "The flag of Bonaire was adopted on 11 December 1981. Noted vexillologist Whitney Smith was involved in developing the flag's design. [0]",
        "meaning": "The blue and yellow triangles represent the sea and sun respectively while the dividing white strip represents the sky. The colors red, white, and blue also show Bonaire's loyalty to the Kingdom of the Netherlands. The black compass represents the population of Bonaire who come from the four corners of the world.\n\nThe red six-pointed star represents the original six villages of Bonaire - Antriol, Nikiboko, Nort Saliña, Playa, Rincon and Tera Korá. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#012A87"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "yellow",
                "hex": "#F9D90F"
            },{
                "name": "red",
                "hex": "#DC171D"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A large blue triangle in the lower right corner and a smaller yellow triangle in the upper left corner. The triangles are separated by a white strip, inside of which are a black compass and a red six-pointed star. [0]",
        "adoptionDate": 1981,
        "related": {
            "country": [
                {
                    "name": "Netherlands",
                    "image": "netherlands.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Bonaire"
        ]
    }
    ,{
        "name": "Sint Eustatius",
        "image": "sint-eustatius.svg",
        "category": "Dependent Territories",
        "history": "The flag of Sint Eustatius was adopted on 16 November 2004 (Statia Day). The island's flag was designed by Zuwena Suares. [0]",
        "meaning": "/",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#012A87"
            },{
                "name": "red",
                "hex": "#DC171D"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "green",
                "hex": "#008830"
            },{
                "name": "yellow",
                "hex": "#F9D90F"
            }
        ],
        "design": "The flag is rectangular with the colors blue, red, white, gold and green, and divided in four five-sided blue squares, each fimbriated red. In its center is a diamond-form white field; in the diamond is the silhouette of the island in green. In the center in the top of the diamond is a five-pointed golden star. [0]",
        "adoptionDate": 2004,
        "related": {
            "country": [
                {
                    "name": "Netherlands",
                    "image": "netherlands.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Sint_Eustatius"
        ]
    }
    ,{
        "name": "Saba",
        "image": "saba.svg",
        "category": "Dependent Territories",
        "history": "The flag of Saba was adopted on December 6, 1985 (national day of the island). 130 different designs were presented to the Commission. The chosen flag was designed by an 18-year-old Saban named Daniel Johnson.\n\nSaba accepted Dutch sovereignty after 1816 and used the Dutch flag. However, since some islanders considered Saba a \"republic\", they added a special symbol – a green cabbage - to emphasize their independence, and this symbol was used probably until about the 1920s. [0]",
        "meaning": "/",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#DC171D"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "blue",
                "hex": "#012A87"
            },{
                "name": "yellow",
                "hex": "#F9D90F"
            }
        ],
        "design": "White losange dividing the field in four triangle-rectangle and charged with a five-points yellow star. The upper two triangles are red and the lower two are blue.",
        "adoptionDate": 1985,
        "related": {
            "country": [
                {
                    "name": "Netherlands",
                    "image": "netherlands.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Saba"
        ]
    }
    ,{
        "name": "Cook Islands",
        "image": "cook-islands.svg",
        "category": "Dependent Territories",
        "history": "The flag of the Cook Islands, officially known as the Cook Islands Ensign, is based on the traditional design for former British colonies in the Pacific region.\n\nFrom 1973 to 1979, the flag was green with the stars in yellow shifted towards the fly. The green colour represented the continuous growth and life of the islands; the yellow represented the faith, love, happiness, and commitment shown by the islanders. [0]",
        "meaning": "The Union Flag is symbolic of the nation's historic ties to the United Kingdom and to the Commonwealth of Nations. The stars stand for the fifteen islands that make up the Cook Islands (Tongareva, Rakahanga, Manihiki, Pukapuka, Nassau, Suwarrow, Palmerston, Aitutaki, Manuae, Takutea, Aitu, Mitiaro, Mauke, Rarotonga and Mangaia). The blue represents the ocean and the peaceful nature of the inhabitants. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#00247D"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#CF142B"
            }
        ],
        "design": "Blue ensign with a ring of fifteen white stars in the fly. [0]",
        "adoptionDate": 1979,
        "related": {
            "country": [
                {
                    "name": "New Zealand",
                    "image": "new-zealand.svg"
                }
            ],
            "similar": [
                {
                    "name": "Australia",
                    "image": "australia.svg"
                },{
                    "name": "New Zealand",
                    "image": "new-zealand.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Cook_Islands"
        ]
    }
    ,{
        "name": "Niue",
        "image": "niue.svg",
        "category": "Dependent Territories",
        "history": "The flag of Niue was adopted on 15 October 1975. [0]",
        "meaning": "The Union Jack symbolises the protection granted by the United Kingdom in 1900 after petitioning by the Kings and Chiefs of Niue. The golden yellow is inspired by the bright sunshine of Niue and also said to symbolise the warm feelings of the Niuean people towards New Zealand and her people. The association with New Zealand, which took over responsibility and administration of Niue in 1901, is also represented by the four small stars that depict the Southern Cross. Finally the blue disc containing a larger star represents the deep blue sea surrounding the self-governing island of Niue. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "yellow",
                "hex": "#FCD116"
            },{
                "name": "blue",
                "hex": "#002868"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#CF142B"
            }
        ],
        "design": "A golden yellow flag, bearing on the upper canton of the hoist thereof the Union Flag, commonly known as the Union Jack, displaying 2 five-pointed yellow stars on the vertical line and on the horizontal line thereof separated by a blue disc containing a larger five-pointed yellow star. [0]",
        "adoptionDate": 1975,
        "related": {
            "country": [
                {
                    "name": "New Zealand",
                    "image": "new-zealand.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Niue"
        ]
    }
    ,{
        "name": "Ross Dependency",
        "image": "ross-dependency.svg",
        "category": "Dependent Territories",
        "history": "Currently, only the New Zealand national flag serves in an official capacity in the Ross Dependency. The only other 'official' flag seen in photographs was the New Zealand Post flag to denote Scott Base's post office.\n\nRoss Dependency (New Zealand's territorial claim in Antarctica) uses the New Zealand flag, but vexillologist James Dignan's design concept was seen flying there at one time (when a friend of Dignan took it with him to Vanda Station in 1994). [0]",
        "meaning": "The New Zealand flag is the basis for his design, though with an 'Ice Blue' background representing the Ross Sea, and the white horizontal bar at the bottom of the flag representing the Ross Ice Shelf. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#6699E5"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#CE142B"
            },{
                "name": "blue",
                "hex": "#00247D"
            }
        ],
        "design": "A light blue field with a white stripe at the bottom, the Union Jack on the canton and four white-filembrated five-point red stars on the fly.",
        "adoptionDate": 1994,
        "related": {
            "country": [
                {
                    "name": "New Zealand",
                    "image": "new-zealand.svg"
                }
            ],
            "similar": [
                {
                    "name": "New Zealand",
                    "image": "new-zealand.svg"
                },{
                    "name": "Tuvalu",
                    "image": "tuvalu.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flags_of_Antarctica#Ross_Dependency"
        ]
    }
    ,{
        "name": "Tokelau",
        "image": "tokelau.svg",
        "category": "Dependent Territories",
        "history": "As Tokelau is a non-self-governing territory of New Zealand, the flag of New Zealand has been used as the official flag for Tokelau. However, in May 2008 the local parliament, the General Fono, approved a distinctive flag and national emblem for Tokelau. This flag has not yet been widely used for official purposes, but an official launch of the new flag was planned for October 2009. The Governor-General presented the flag to the Ulu-o-Tokelau as Tokelau's first official flag on 7 September 2009.\n\nA referendum on self-determination in 2006 failed to carry (it was supported, but not with the necessary supermajority), and another one in October 2007 fell 16 votes short. [0]",
        "meaning": "Tokelau's Flag depicts a Tokelauan canoe sailing towards the manu (Southern Cross). The canoe symbolises Tokelau's journey towards finding the best governance structure for its people; the Southern Cross symbolises a navigational aid for the journey. The Southern Cross has helped Tokelauan fishermen navigate the waters around Tokelau for centuries while they have fished to sustain families and villages with its riches.\n\nThe white stars of the Southern Cross are a symbol of Christianity, an important part of everyday life in Tokelau. White also signifies the cooperation and unity among the atolls of Tokelau and a shared aspiration to secure a better life for Tokelauans. Yellow signifies a happy, peaceful community. Blue signifies the ocean on which Tokelauans depend for their livelihood and is also the colour of the sky which holds the stars that direct Tokelau's people. [1]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "blue",
                "hex": "#00247D"
            },{
                "name": "yellow",
                "hex": "#FED100"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A blue flag with a yellow stylised Tokelauan canoe in full sail, with in the space near the hoist a southern cross of four small white five-pointed stars. [1]",
        "adoptionDate": 2008,
        "related": {
            "country": [
                {
                    "name": "New Zealand",
                    "image": "new-zealand.svg"
                }
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Tokelau",
            "https://flagspot.net/flags/tk.html"
        ]
    }
]