[
    {
        "name": "Somaliland",
        "category": "Unrecognized States",
        "history": "The flag of Somaliland is used in Somaliland, a self-declared republic that is internationally recognized as an autonomous region of Somalia. Having established its own local government in 1991, the region's self-declared independence remains unrecognized by any country or international organization. [0]",
        "meaning": "The flag contains the Pan-Arab colors of green, black, white and red. On the green stripe, there is the Sunni Shahada in white script, similar to that of the Saudi Arabian flag. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "green",
                "hex": "#006D21"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#DF0000"
            },{
                "name": "black",
                "hex": "#000000"
            }
        ],
        "design": "A horizontal tricolor of green, white which means the peace achieved after the war, and red Which stands for the blood that had to be spilled for independence, with the Shahada inscribed in the green stripe, and a black 5-pointed star charged on the white stripe. [0]",
        "adoptionDate": 1993,
        "related": {
            "country": [
                "Somalia"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Somaliland"
        ]
    }
    ,{
        "name": "Sahrawi Arab Democratic Republic",
        "category": "Unrecognized States",
        "history": "The flag of the Sahrawi Arab Democratic Republic is a combination of the Pan-Arab colors of black, green, white, and red, and the Islamic symbol of the star and crescent. On 27 February 1976 the flag was adopted as the official flag of the Sahrawi Arab Democratic Republic (SADR). It was slightly modified in June 1991. It is said to be designed by El Uali Mustapha Sayed, the first president of the Sahrawi Republic. This flag is commonly referred to as the \"flag of Western Sahara\".\n\nThe flag is a tricolor of three equal horizontal stripes (black, white, and green from top to bottom) overlaid by a red triangle issuing from the hoist. These are the Pan-Arab colors. There is a red star and crescent in the middle stripe.\n\nThe flag is extremely similar to the flags of the Baath Party, Jordan, Palestine, and the Arab Federation all of which draw their inspiration from the Arab Revolt against Ottoman rule (1916–1918). Prior to being the flag of Palestine, it was the flag of the short lived Arab Federation of Iraq and Jordan. The flag of the Arab Revolt had the same graphic form, but the colours were arranged differently (white on the bottom, rather than in the middle).\n\nIts design is based on that of the Palestinian flag,[2] which in turn was derived from the colors used in the Arab Revolt. The star and crescent are considered symbols of Islam, and can be seen on flags of other neighbouring Islamic countries such as Algeria and Mauritania. [0]",
        "meaning": "See History.",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#C4111B"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "green",
                "hex": "#007A3D"
            }
        ],
        "design": "A black, white, and green horizontal tricolor charged with a red star and crescent in the center stripe and a red triangle at the hoist. [0]",
        "adoptionDate": 1976,
        "related": {
            "country": [
                "Morocco"
            ],
            "memberOf": [
                "African Union"
            ],
            "similar": [
                "Jordan",
                "Palestine"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Western_Sahara#Flag_of_the_Sahrawi_Arab_Democratic_Republic"
        ]
    }
    ,{
        "name": "Nagorno-Karabakh",
        "category": "Unrecognized States",
        "history": "On June 2, 1992, the self-proclaimed Republic of Nagorno-Karabakh, a de facto independent republic claimed by Azerbaijan, in the South Caucasus region, adopted a flag derived from the flag of Armenia, with only a white pattern added. [0]",
        "meaning": "Nagorno-Karabakh Republic's flag heavily borrowed from that of the Republic of Armenia. Similar to the Armenian flag, the red stands for the blood of the 1.5 million Armenians killed in the Armenian Genocide, blue is for the Armenian pure sky, and orange represents the country's courage. Artsakh uses this flag because a majority of its inhabitants are and consider their nation to be Armenian.\n\nThe white pattern symbolizes the current separation of Artsakh (the Nagorno-Karabakh Republic) from Armenia proper and its aspiration for eventual union with \"the Motherland\". This symbolizes the Armenian heritage, culture and population of the area, and represents Nagorno-Karabakh as a separated region of Armenia by the triangular shape and the zigzag cutting through the flag. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#D90012"
            },{
                "name": "blue",
                "hex": "#0033A0"
            },{
                "name": "orange",
                "hex": "#F2A800"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A horizontal tricolor of red, blue, and orange with a white sideways zig-zag chevron in the fly. [0]",
        "adoptionDate": 1992,
        "related": {
            "country": [
                "Azerbaijan"
            ],
            "similar": [
                "Armenia"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Nagorno-Karabakh_Republic"
        ]
    }
    ,{
        "name": "Palestine",
        "category": "Unrecognized States",
        "history": "On October 18, 1948, the flag of the Arab Revolt was adopted by the All-Palestine Government, and was recognised subsequently by the Arab League as the flag of Palestine. A modified version (changing the order of stripes) was officially adopted as the flag of the Palestinian people by the Palestine Liberation Organization (PLO) in 1964. On November 15, 1988 the PLO adopted the flag as the flag of the State of Palestine.\n\nOn the ground the flag became widely used since the Oslo Agreements, with the establishment of the Palestinian Authority in 1993. Today the flag is flown widely by Palestinians and their supporters.\n\nIn 1967, immediately following the Six Day War, the State of Israel banned the Palestinian flag in the occupied Gaza Strip and West Bank. A 1980 law forbidding artwork of \"political significance\" banned artwork composed of its four colours, and Palestinians were arrested for displaying such artwork. Since the signing of the Oslo Peace Accords in 1993, the ban has been abolished. [0]",
        "meaning": "The flag is almost identical to that of the Arab Socialist Ba'ath Party, and extremely similar to the Flag of Jordan and Flag of Western Sahara, all of which draw their inspiration from the Arab Revolt against Ottoman rule (1916–1918). Prior to being the flag of the Palestinian people, it was the flag of the short lived Arab Federation of Iraq and Jordan. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#CE1126"
            },{
                "name": "black",
                "hex": "#000000"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "green",
                "hex": "#007A3D"
            }
        ],
        "design": "A horizontal tricolour of black, white, and green; with a red triangle based at the hoist. [0]",
        "adoptionDate": 1964,
        "related": {
            "country": [
                "Israel"
            ],
            "memberOf": [
                "Arab League"
            ],
            "similar": [
                "Jordan",
                "Sahrawi Arab Democratic Republic"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Palestinian_flag"
        ]
    }
    ,{
        "name": "Taiwan",
        "category": "Unrecognized States",
        "history": "In Chinese, the flag is commonly described as Blue Sky, White Sun, and a Wholly Red Earth (traditional Chinese: 青天白日滿地紅; simplified Chinese: 青天白日满地红; pinyin: Qīng Tiān, Bái Rì, Mǎn Dì Hóng) to reflect its attributes.\n\nIt was first used in China by the Kuomintang (KMT, the Chinese Nationalist Party) in 1917 and was made the official flag of the Republic of China in 1928. It was enshrined in the 6th article of the Constitution of the Republic of China when it was promulgated in 1947. Since 1949, the flag is mostly used within Taiwan, Penghu, Kinmen, Matsu and other outlying islands where the Republic of China relocated after having lost the Chinese Civil War to the Communists. As of 2016 the Republic of China is usually known as Taiwan. [0]",
        "meaning": "In the \"Blue Sky with a White Sun\" flag of Lu Hao-tung, the twelve rays of the white Sun symbolize the twelve months and the twelve traditional shichen (時辰, shíchén), a traditional unit of time which corresponds to two modern hours. Sun Yat-sen added the \"Red Earth\" to the flag to signify the blood of the revolutionaries who sacrificed themselves in order to overthrow the Qing Dynasty and create the ROC. Together, the three colors of the flag correspond to the Three Principles of the People: Blue represents nationalism and liberty; White represents democracy and equality; and Red represents the people's livelihood and fraternity. [0]",
        "ratio": "2:3",
        "colors": [
            {
                "name": "blue",
                "hex": "#000095"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#FE0000"
            }
        ],
        "design": "A red field with a navy blue canton bearing a white sun with 12 triangular rays. [0]",
        "adoptionDate": 1928,
        "related": {
            "country": [
                "China"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_the_Republic_of_China"
        ]
    }
    ,{
        "name": "Northern Cyprus",
        "category": "Unrecognized States",
        "history": "The flag of the Turkish Republic of Northern Cyprus, a self-declared state since 1974, recognised only by Turkey, is based on the flag of Turkey with the colors reversed and two horizontal red stripes added at the top and bottom. It was the result of a competition to find a new representative flag for the TRNC. The local use of the Turkish flag is somewhat similar to the use of the Greek flag in the rest of the island. [0]",
        "meaning": "See History.",
        "ratio": "2:3",
        "colors": [
            {
                "name": "red",
                "hex": "#E30A17"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A red star and crescent slightly to the left of the center between two horizontal red bars on a white field. [0]",
        "adoptionDate": 1983,
        "related": {
            "country": [
                "Cyprus"
            ],
            "similar": [
                "Turkey"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_"
        ]
    }
    ,{
        "name": "Abkhazia",
        "category": "Unrecognized States",
        "history": "The flag of the Republic of Abkhazia was created in 1991 by V. Gamgia. It was officially adopted on 23 July 1992. The design of the red canton is based on the banner of the medieval Kingdom of Abkhazia. [0]",
        "meaning": "The open right hand means \"Hello to friends! Stop to Enemies!\". The seven stars in the canton have since been reinterpreted to correspond to the seven historical regions of the country - Sadzen, Bzyp, Gumaa, Abzhywa, Samurzaqan, Dal-Tsabal and Pskhuy-Aibga.\n\nSeven is a number sacred to the Abkhaz and the green and white stripes represent the tolerance that allows Christianity and Islam to cohabit. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "green",
                "hex": "#00993E"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#C8312A"
            }
        ],
        "design": "Seven horizontal stripes alternating green and white; in the canton, a white open hand below a semicircle of seven five-pointed stars on a red field. [0]",
        "adoptionDate": 1992,
        "related": {
            "country": [
                "Georgia"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Abkhazia"
        ]
    }
    ,{
        "name": "Kosovo",
        "category": "Unrecognized States",
        "history": "The flag of the Republic of Kosovo was adopted by the Assembly of Kosovo immediately following the declaration of independence of the Republic of Kosovo from Serbia on 17 February 2008.[2][3] The flag is the result of an international design competition, organised by the United Nations-backed Kosovo Unity Team, which attracted almost one thousand entries. The now-used design is a variant of one proposal designed by Muhamer Ibrahimi. [0]",
        "meaning": "The stars symbolise Kosovo's six major ethnic groups. [0]",
        "ratio": "5:7",
        "colors": [
            {
                "name": "blue",
                "hex": "#244AA5"
            },{
                "name": "yellow",
                "hex": "#D0A650"
            },{
                "name": "white",
                "hex": "#FFFFFF"
            }
        ],
        "design": "A blue field charged with a map of Kosovo in gold, surmounted by an arc of six, white five-pointed stars, in the centre. [0]",
        "adoptionDate": 2008,
        "related": {
            "country": [
                "Serbia"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Kosovo"
        ]
    }
    ,{
        "name": "South Ossetia",
        "category": "Unrecognized States",
        "history": "The flag of South Ossetia has identical colours to the flag of North Ossetia-Alania, but slightly different proportions (being narrower horizontally).\n\nUnder the Soviet Union, North Ossetia had a predominantly red flag with a blue trim on the left edge, the hammer and sickle and the words \"North Ossetian ASSR\" in both Russian and Ossetian. Shortly before the collapse of the Soviet Union, it was replaced with the present flag, which was adopted on October 2, 1991. [0]",
        "meaning": "The colours symbolize moral purity (white), martial courage (red), and wealth and prosperity (yellow).\n\nThe flag is also said to represent the social structure of ancient Ossetian society, which was divided into three social groups forming an organic whole: the military aristocracy, the clergy, and ordinary people. [0]",
        "ratio": "1:2",
        "colors": [
            {
                "name": "white",
                "hex": "#FFFFFF"
            },{
                "name": "red",
                "hex": "#FF0000"
            },{
                "name": "yellow",
                "hex": "#FFDF00"
            }
        ],
        "design": "A horizontal triband of white, red and yellow. [0]",
        "adoptionDate": 1991,
        "related": {
            "country": [
                "Georgia"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_South_Ossetia"
        ]
    }
    ,{
        "name": "Transnistria",
        "category": "Unrecognized States",
        "history": "The flag of Transnistria comprises a version of the 1952-1990 flag of the Moldavian Soviet Socialist Republic. Transnistria adopted this design in the 2000 Law about State Symbols.\n\nThe flag of the Moldavian Soviet Socialist Republic served as the republic's flag until the dissolution of the Soviet Union in 1991. When Moldova became independent, some places in Transnistria refused to fly the new Moldovan flag and continued to fly the flag of the Soviet Union. Continued use of the flag of the former Moldavian SSR was popular and it was officially reintroduced as the flag of Transnistria in 2000. Confusingly, despite the flag and coat of arms, Transnistria is not a Socialist state. [0]",
        "meaning": "See History.",
        "ratio": "1:2",
        "colors": [
            {
                "name": "red",
                "hex": "#DE0000"
            },{
                "name": "green",
                "hex": "#009933"
            },{
                "name": "yellow",
                "hex": "#FFD700"
            }
        ],
        "design": "Three horizontal bands of red, green and red, with a hammer and sickle in the canton. [0]",
        "adoptionDate": 2000,
        "related": {
            "country": [
                "Moldova"
            ]
        },
        "sources": [
            "https://en.wikipedia.org/wiki/Flag_of_Transnistria"
        ]
    }
]
